[{"Name": "Allergies", "Cure": "\nAn allergy is a reaction the body has to a particular food or substance.\nAllergies are very common. They're thought to affect more than 1 in 4 people in the UK at some point in their lives.\nThey are particularly common in children. Some allergies go away as a child gets older, although many are lifelong. Adults can develop allergies to things they weren't previously allergic to.\nHaving an allergy can be a nuisance and affect your everyday activities, but most allergic reactions are mild and can be largely kept under control. Severe reactions can occasionally occur, but these are uncommon.\nCommon allergies\nSubstances that cause allergic reactions are called allergens. The more common allergens include:\n\ngrass and tree pollen – an allergy to these is known as hay fever (allergic rhinitis)\ndust mites\nanimal dander (tiny flakes of skin or hair)\nfood – particularly nuts, fruit, shellfish, eggs and cow's milk\ninsect bites and stings\nmedication – including ibuprofen, aspirin, and certain antibiotics\nlatex – used to make some gloves and condoms\nmould – these can release small particles into the air that you can breathe in\nhousehold chemicals – including those in detergents and hair dyes\n\nMost of these allergens are generally harmless to people who aren't allergic to them.\nSymptoms of an allergic reaction\nAllergic reactions usually happen quickly within a few minutes of exposure to an allergen.\nThey can cause:\n\nsneezing\na runny or blocked nose\nred, itchy, watery eyes\nwheezing and coughing\na red, itchy rash\nworsening of asthma or eczema symptoms\n\nMost allergic reactions are mild, but occasionally a severe reaction called anaphylaxis or anaphylactic shock can occur. This is a medical emergency and needs urgent treatment.\nRead more about the symptoms of allergies.\nWhen to get professional advice\n"}, {"Name": "Ankle Problems", "Cure": "\nAnkle problems can cause a range of symptoms including pain, swelling and stiffness.\nIn many cases, new or flare-up of long-standing ankle problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nSpeak to a healthcare professional as soon as possible if:\n\nthere's been significant trauma, for example a fall from height or direct blow to the ankle\nyour ankle is misshapen\nyour calf is hot, swollen and tender\nyou've difficulty putting weight on your leg\nyou've pain that's worsening\n\nWhat causes ankle problems?\nAnkle problems are fairly common and can be caused by injuries such as tripping or going over on your ankle.\nMuscle weakness around the ankle can also cause ankle problems to flare-up now and again. It may also be due to a flare up of an existing problem.\nCan this cause problems anywhere else?\nYou may feel some pain in the muscles around your calf and foot. This should improve as your ankle problem gets better.\nAnkle problems can also cause limping. If the limp is severe, using a walking stick on the opposite side to your ankle problem may help.\nHow to use a walking stick\nSelf-help\nKeeping active is an essential part of your treatment and recovery and is the single best thing you can do for your health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you have less discomfort and good movement. Remember to warm up before sports.\nExercises to help with ankle problems\nResting or moving?\nWithin the first 24 to 48 hours of the onset of an ankle problem you should try to:\n\nrest your ankle in an elevated position but avoid long spells of not moving at all\nmove your ankle gently for 10 to 20 seconds every hour when you're awake\n\nAfter 48 hours:\n\ntry to use your leg more - exercise really helps your ankle and can relieve pain\ndo whatever you normally would and stay at, or return to work - this is important and is the best way to get better\nlead with your good leg when going upstairs to reduce the strain on your ankle\nlead with your problem leg when going downstairs to reduce the strain on your ankle\nuse a handrail (if available) when going up and downstairs\n\nPain treatments\nPain medication can help to reduce the pain and help you move more comfortably, which can help your recovery.\nSpeak to your community pharmacist or other healthcare professional about taking medication or other methods of pain relief. It's important to take medication regularly.\nMore about taking painkillers\nWork\nIt's recommended you stay at or return to work as quickly as possible during your recovery. You don't need to be pain or symptom-free to return to work.\nHelp and support\nIf, after following this advice, your ankle problem hasn't improved within 6 weeks a referral to a physiotherapist or podiatrist may be of benefit.\nIf available in your health board area, the Musculoskeletal (MSK) Helpline can refer you to a healthcare professional if you need it.\n"}, {"Name": "Back Problems", "Cure": "\nMost back problems start for no obvious reason, which can be very frustrating. The spine is strong and back problems are rarely due to any serious disease or damage.\nBack problems can cause a range of symptoms, including:\n\nstiffness\nmuscle spasms\nhot, burning, shooting or stabbing pains in your back and sometimes into one or both of your legs\npins and needles due to nerve irritation\n\nIn many cases, new or flare-up of long-standing back problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nFor most back pain problems, you'll not normally need an X-ray or MRI scan.\nWhen to get professional advice\n"}, {"Name": "Bowel Incontinence", "Cure": "\nBowel incontinence is an inability to control bowel movements, resulting in involuntary soiling. It's also sometimes known as faecal incontinence.\nThe experience of bowel incontinence can vary from person to person. Some people feel a sudden need to go to the toilet but are unable to reach a toilet in time. This is known as urge bowel incontinence.\nOther people experience no sensation before soiling themselves, known as passive incontinence or passive soiling, or there might be slight soiling when passing wind.\nSome people experience incontinence on a daily basis, whereas for others it only happens from time to time.\nIt's thought 1 in 10 people will be affected by it at some point in their life. It can affect people of any age, although it's more common in elderly people. It's also more common in women than men.\nWhy bowel incontinence happens\nBowel incontinence is a symptom of an underlying problem or medical condition.\nMany cases are caused by diarrhoea, constipation, or weakening of the muscle that controls the opening of the anus.\nIt can also be caused by long-term conditions such as diabetes, multiple sclerosis and dementia.\nRead more about the causes of bowel incontinence.\nSeeking advice and treatment\nBowel incontinence can be upsetting and hard to cope with, but treatment is effective and a cure is often possible, so make sure you see your GP.\nIt's important to remember that:\n\nBowel incontinence isn't something to be ashamed of – it's simply a medical problem that's no different from diabetes or asthma.\nIt can be treated – there's a wide range of successful treatments.\nBowel incontinence isn't a normal part of ageing.\nIt won't usually go away on its own – most people need treatment for the condition.\n\nIf you don't want to see your GP, you can usually make an appointment at your local NHS continence service without a referral. These clinics are staffed by specialist nurses who can offer useful advice about incontinence.\nRead more about diagnosing bowel incontinence.\nHow bowel incontinence is treated\nIn many cases, with the right treatment, a person can maintain normal bowel function throughout their life.\nTreatment will often depend on the cause and how severe it is, but possible options include:\n\nlifestyle and dietary changes to relieve constipation or diarrhoea\nexercise programmes to strengthen the muscles that control the bowel\nmedication to control diarrhoea and constipation\nsurgery, of which there are a number of different options\n\nIncontinence products, such as anal plugs and disposable pads, can be used until your symptoms are better controlled.\nEven if it isn't possible to cure your bowel incontinence, symptoms should improve significantly.\nRead more about treating bowel incontinence.\n"}, {"Name": "Calf Problems", "Cure": "\nCalf problems can cause a range of symptoms including pain, bruising, tightness and stiffness.\nIn many cases, new or flare-up of long-standing calf problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nSpeak to a healthcare professional as soon as possible if:\n\nyour calf is hot, swollen or tender and tense to touch - especially if you can't recall an injury\nyou can't put any weight through your leg\nyou can't lift your heel off the floor\n\nWhat causes calf muscle problems?\nCalf problems are usually caused by injuries such as tripping, direct hit or sporting activities.\nThere are other less common causes of calf problems - such as back problems or circulatory complaints.\nCan this cause problems anywhere else?\nYou may feel some pain in the muscles around your knee, ankle or foot. This should improve as your calf problem gets better.\nOccasionally, problems felt in your calf can be due to a back problem - even though you do not feel pain in your back. People with this sort of problem often describe the pain as pins and needles, sharp, hot or burning pain, usually in the back of the calf.\nIf you experience these for longer than 6 weeks, you may need to speak to a healthcare professional.\nSelf-help\nKeeping active is an essential part of your treatment and recovery and is the single best thing you can do for your health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you have less discomfort and good movement. Remember to warm up fully before you start sporting activities.\nExercises to help with knee problems\nResting or moving?\nWithin the first 24 to 48 hours after a calf injury you should try to:\n\nrest your calf but avoid long spells of not moving at all\nmove your ankle and knee gently for 10 to 20 seconds every hour when you are awake\n\nAfter 48 hours:\n\ntry to use your leg more - exercise really helps your calf and can relieve pain\ndo whatever you normally would and stay at, or return to work - this is important and is the best way to get better\nlead with your good leg when going upstairs to reduce the strain on your calf\nlead with your problem leg when going downstairs to reduce the strain on your calf\nuse a handrail (if available) when going up and downstairs\n\nPain treatments\nPain medication can help to reduce the pain and help you move more comfortably, which can help your recovery.\nSpeak to your community pharmacist or other healthcare professional about taking medication or other methods of pain relief. It's important to take medication regularly.\nMore about taking painkillers\nWork\nIt's recommended you stay at or return to work as quickly as possible during your recovery. You don't need to be pain and symptom-free to return to work.\nHelp and support\nIf, after following the above advice, your calf problem hasn't improved within 6 weeks a referral to a physiotherapist or podiatrist may be of benefit.\nIf available in your health board area, the Musculoskeletal (MSK) Helpline can refer you to a healthcare professional if you need it.\n"}, {"Name": "Catarrh", "Cure": "\nCatarrh is a build-up of mucus in an airway or cavity of the body.\nIt usually affects the back of the nose, the throat or the sinuses (air-filled cavities in the bones of the face).\nIt's often temporary, but some people experience it for months or years. This is known as chronic catarrh.\nCatarrh can be a nuisance and may be difficult to get rid of, but it's not harmful and there are treatments available.\nSymptoms associated with catarrh\nCatarrh can lead to a:\n\nconstant need to clear your throat\nfeeling that your throat is blocked\nblocked or stuffy nose that you can't clear\nrunny nose\nfeeling of mucus running down the back of your throat\npersistent cough\nheadache or facial pain\nreduced sense of smell and taste\ncrackling sensation in your ear and some temporary hearing loss\n\nThese problems can be frustrating to live with and may affect your sleep, making you feel tired.\nTreatments for catarrh\nCatarrh will often pass in a few days or weeks as the condition that causes it improves.\nThere are things you can try at home to relieve your symptoms, such as:\n\navoiding things that trigger your symptoms, such as allergens or smoky places\ntaking sips of cold water when you feel the need to clear your throat – constantly clearing your throat may make things worse\nusing a saline nasal rinse several times a day – these can be bought from a pharmacy or made at home with half a teaspoon of salt in a pint of boiled water that's been left to cool\navoiding warm, dry atmospheres, such as places with air conditioning and car heating systems – placing plants or bowls of water in a room may help to keep the air humid\nstaying well hydrated\ntalking to a pharmacist about suitable over-the-counter medications – including decongestants, antihistamines or steroid nasal sprays\n\nThere are also several remedies, such as herbal medicines, available from health shops and pharmacies that claim to treat catarrh. Some people find these helpful, but there's generally little scientific evidence to suggest they work.\nWhen to see your GP\nSpeak to your GP if your catarrh persists and is becoming difficult to live with.\nThey may want to rule out conditions that could be causing it, such as nasal polyps or allergies. This may mean you need to be referred to a specialist for tests.\nIf you're diagnosed with a specific underlying condition, treating it may help relieve your catarrh. For example, nasal polyps may be treated with a steroid nasal spray, or in some cases surgery. \nIf a cause for you catarrh cannot be found, the self-help techniques above may be recommended. Unfortunately, however, chronic catarrh can be hard to treat and may last for a long time.\nWhat causes catarrh?\nCatarrh is usually caused by the immune system reacting to an infection or irritation, which causes the lining of your nose and throat to become swollen and produce mucus.\nThis can be triggered by:\n\na cold or other infections\nhay fever or other types of allergic rhinitis\nnon-allergic rhinitis\nnasal polyps\n\nIt's unclear what causes chronic catarrh, but it's not thought to be the result of an allergy or infection.\nIt may be related to an abnormality in the way mucus travels within the nose or an increased sensitivity to mucus in the back of the nose and throat.\n"}, {"Name": "Chest Pain", "Cure": "\nChest pain can be caused by anything from muscle pain to a heart attack and should never be ignored.\nWhen to get help for chest pain\nYou should call 999 for an ambulance immediately if you develop sudden severe chest pain, particularly if:\n\nthe pain feels heavy, pressing or tight\nthe pain lasts longer than 15 minutes\nthe pain spreads to other parts of your body, such as your arms, back or jaw\nyou also have other symptoms, such as breathlessness, nausea, sweating, or coughing up blood\nyou are at risk of coronary heart disease – for example, you smoke, are obese, or have high blood pressure, diabetes or high cholesterol\n\nIf the discomfort is only minor or has resolved, it may be more appropriate to either:\n\nspeak to your GP\ncall the 111 service\n\nCould it be a heart problem?\nChest pain isn't always caused by a problem with your heart, but it can sometimes be a symptom of:\n\nangina – where the blood supply to the muscles of the heart is restricted\na heart attack – where the blood supply to part of the heart is suddenly blocked\n\nBoth of these conditions can cause a dull, heavy or tight pain in the chest that can spread to the arms, neck, jaw or back. They can also cause additional symptoms, such as breathlessness and nausea.\nThe main differences between these conditions is that chest pain caused by angina tends to be triggered by physical activity or emotional stress, and gets better with rest after a few minutes.\nIf you have previously been diagnosed with angina, the pain may also be relieved by your angina medication.\nSymptoms that last more than 15 minutes, occur at rest, and include sweating and vomiting are more likely to be caused by a heart attack.\nDial 999 immediately to request an ambulance if you think you or someone else is having a heart attack, or if you have the symptoms above and haven't been diagnosed with a heart condition.\nIf you have an angina attack and you've previously been diagnosed with the condition, take the medication prescribed for you. A second dose can be taken after five minutes if the first dose is ineffective.\nIf there is no improvement five minutes after the second dose, call 999 and ask for an ambulance.\nCommon causes of chest pain\nMost chest pain is not heart-related and isn't a sign of a life-threatening problem. Some common causes of chest pain are outlined below.\nThis information should give you an idea of whether these conditions may be causing your chest pain, but you should always seek medical advice to make sure you get a proper diagnosis.\nGastro-oesophageal reflux disease (GORD)\nGastro-oesophageal reflux disease is a common condition where acid from the stomach comes up into the oesophagus (gullet).\nCommon symptoms of GORD include:\n\nburning chest pain (heartburn)\nan unpleasant taste in the mouth caused by stomach acid coming back up into your mouth\n\nThese symptoms usually occur soon after you've eaten and get worse if you bend over or lie down.\nGORD can often be treated by making lifestyle changes and, if necessary, using medication. Read more about treating GORD.\nBone or muscle problems\nIf your chest is painful and tender to touch, it may be caused by a strained muscle in your chest wall. This can be surprisingly painful, but with rest the pain should ease and the muscle will heal in time.\nIf you have pain, swelling and tenderness around your ribs, and the pain is made worse by lying down, breathing deeply, coughing or sneezing, you may have a condition called costochondritis.\nThis is caused by inflammation in the joints between the cartilage that joins the ribs to the breastbone (sternum). The symptoms often improve after a few weeks and may be relieved by painkillers.\nAnxiety and panic attacks\nSome episodes of chest pain occur as part of an anxiety or panic attack.\nIn addition to chest pain and overwhelming feelings of anxiety, these attacks can cause symptoms such as heart palpitations, sweating, breathlessness and dizziness.\nMost panic attacks last for 5 to 20 minutes. In the long-term, you may benefit from psychological therapy and medication, or both. \nLung conditions\nIf you have sharp chest pain that gets worse when you breathe in and out, and is accompanied by other symptoms such as a cough and breathlessness, it may be caused by a condition affecting the lungs or surrounding tissue, such as:\n\npneumonia – inflammation of the lungs, usually caused by an infection\npleurisy – inflammation of the membrane surrounding the lungs, also usually caused by an infection\n\nMild cases of pneumonia can usually be treated with antibiotics, rest and fluids. For people with other health conditions, the condition can be severe and they may need to be treated in hospital.\nTreatment for pleurisy will depend on the underlying cause. Pleurisy caused by a viral infection will often resolve without needing treatment, whereas pleurisy caused by a bacterial infection will usually need to be treated with antibiotics.\nAgain, people who are frail or already in poor health may need to be admitted to hospital for treatment.\nOther possible causes of chest pain\nThere are many other potential causes of chest pain, including:\n\nshingles – a viral infection of a nerve and the area of skin around it, which causes a painful rash that develops into itchy blisters\nmastitis – pain and swelling of the breast, which is usually caused by an infection, most commonly during breastfeeding\nacute cholecystitis – inflammation of the gallbladder, which can cause a sudden sharp pain in the upper right side of your tummy that spreads towards your right shoulder\nstomach ulcers – a break in the lining of the stomach, which can cause a burning or gnawing pain in your tummy\na pulmonary embolism – a blockage in the blood vessel that carries blood from the heart to the lungs, which can cause sharp, stabbing chest pain that may be worse when you breathe in, as well as breathlessness, a cough and dizziness\npericarditis – inflammation of the sac surrounding your heart, which can cause a sudden, sharp and stabbing pain in your chest, or more of a dull ache; the pain usually worsens when lying down\n\nSome of these conditions can be very serious. Make sure you seek medical advice so you can be correctly diagnosed and treated.\n"}, {"Name": "Chilblains", "Cure": "\nChilblains are small, itchy swellings on the skin that occur as a reaction to cold temperatures.\nThey most often affect the body's extremities, such as the toes, fingers, heels, ears and nose.\nChilblains can be uncomfortable, but rarely cause any permanent damage. They normally heal within a few weeks if further exposure to the cold is avoided.\n \nSigns and symptoms of chilblains\nChilblains usually develop several hours after exposure to the cold. They typically cause a burning and itching sensation in the affected areas, which can become more intense if you go into a warm room.\nThe affected skin may also swell and turn red or dark blue.\nIn severe cases, the surface of the skin may break and sores or blisters can develop. \nIt's important not to scratch the skin as it can break easily and become infected.\nWhen to seek medical advice for chilblains\nMost people don't need to seek medical advice if they have chilblains as they usually heal within a few weeks and don't cause any permanent problems.\nSee your GP or chiropodist for advice if you have:\n\nsevere or recurring chilblains\nchilblains that don't improve within a few weeks\n\nYou should also seek medical advice if you think your skin may have become infected.\nSigns of infection include:\n\nswelling and pus forming in the affected area\nfeeling generally unwell\na high temperature (fever) of 38C (100.4F) or above\nswollen glands\n\nWhat causes chilblains?\nChilblains are the result of an abnormal reaction to the cold. They're common in the UK because damp, cold weather is usual in the winter.\nSome people develop chilblains that last for several months every winter.\nWhen the skin is cold, blood vessels near its surface get narrower. If the skin is then exposed to heat, the blood vessels become wider.\nIf this happens too quickly, blood vessels near the surface of the skin can't always handle the increased blood flow.\nThis can cause blood to leak into the surrounding tissue, which may cause the swelling and itchiness associated with chilblains.\nSome people are more at risk of chilblains than others.\nThis includes people with:\n\npoor circulation\na family history of chilblains\nregular exposure to cold, damp or draughty conditions\na poor diet or low body weight\nlupus – a long-term condition that causes swelling in the body's tissues\nRaynaud's phenomenon – a common condition that affects the blood supply to certain parts of the body, usually the fingers and toes\n\nPeople who smoke are more at risk of chilblains as nicotine constricts blood vessels.\nChilblains can also occur on areas of the feet exposed to pressure, such as a bunion or a toe that's squeezed by tight shoes.\nTreating chilblains\nChilblains often get better on their own after a week or two without treatment.\nIt may help to use a soothing lotion, such as calamine or witch hazel, to relieve itching. Your pharmacist may also be able to recommend a suitable product.\nIf your chilblains are severe and keep returning, speak to your GP. They may recommend taking a daily tablet or capsule of a medication called nifedipine. This works by relaxing the blood vessels, improving your circulation. \nNifedipine can be used to help existing chilblains heal, or can be taken during the winter to stop them developing.\nPreventing chilblains\nIf you're susceptible to chilblains, you can reduce your risk of developing them by:\n\nlimiting your exposure to the cold\nlooking after your feet\ntaking steps to improve your circulation\n\nIf your skin gets cold, it's important to warm it up gradually. Heating the skin too quickly – for example, by placing your feet in hot water or near a heater – is one of the main causes of chilblains.\nThe following advice should help:\n\nstop smoking – nicotine causes the blood vessels to constrict, which can make chilblains worse\nkeep active – this helps improve your circulation\nwear warm clothes and insulate your hands, feet and legs – wearing long johns, long boots, tights, leg warmers or long socks will help, and it's a good idea to wear a clean pair of socks if you get cold feet in bed\navoid tight shoes and boots – these can restrict the circulation to your toes and feet\nmoisturise your feet regularly – this stops them drying out and the skin cracking\neat at least one hot meal during the day – this will help warm your whole body, particularly in cold weather\nwarm your shoes on the radiator before you put them on – make sure damp shoes are dry before you wear them; if your feet are already cold, make sure your shoes aren't too hot to avoid causing chilblains\nwarm your hands before going outdoors – soak them in warm water for several minutes and dry thoroughly, and wear cotton-lined waterproof gloves if necessary; if your hands are already cold, make sure not to warm them up too quickly to avoid causing chilblains\nkeep your house well heated – try to keep one room in the house warm and avoid drafts\nif you're diabetic, regularly check your feet (or ask someone else to do this) – people with diabetes may not be able to feel their feet and could have infected chilblains without realising it\n\nComplications of chilblains\nIf you have severe or recurring chilblains, there's a small risk of further problems developing, such as:\n\ninfection from blistered or scratched skin\nulcers forming on the skin\npermanent discolouration of the skin\nscarring of the skin\n\nIt's often possible to avoid these complications by:\n\nnot scratching or rubbing the affected areas of skin\nnot directly overheating the chilblains (by using hot water, for example)\n\nYou can also help reduce your risk of infection by cleaning any breaks in your skin with antiseptic and covering the area with an antiseptic dressing. The dressing should be changed every other day until the skin heals. \nIf the skin does become infected, antibiotics may be prescribed to treat the infection.\n"}, {"Name": "Chronic Pain", "Cure": "\nChronic or persistent pain is pain that carries on for longer than 12 weeks despite medication or treatment.\nMost people get back to normal after pain following an injury or operation. But sometimes the pain carries on for longer or comes on without any history of an injury or operation.\nChronic pain can also affect people living with:\n\ndiabetes\narthritis\nfibromyalgia\nirritable bowel\nback pain\n\nWhat is pain?\nThe brain and the nerves inside the spine (the spinal nerves) make up the central nervous system. The spinal nerves carry messages from the body to the brain to tell it what's going on.\nThe brain acts like a control centre working out from these messages if it needs to do anything.  It's sometimes easier to think of how the messages and the brain combine together to form an alarm system. It's the brain’s interpretation of this information from the alarm system that results in the feeling of pain. Sometimes the brain’s interpretation of these signals isn't accurate.\nWe usually expect pain to settle down with time but sometimes the brain continues to send out pain signals. These signals can be hard to stop, are often intense and at times seem to come for no obvious reason. This fact isn't always easy to understand but it important to understand that this pain is still “real”.\nPain is very real and can be complex. \nMore about the causes of pain\nHow common is chronic pain?\nChronic pain affects 1 in 5 people in Scotland. It can affect all ages and all parts of the body.\nIt isn't possible to tell in advance whose pain will become chronic. But we know that people are more likely to develop chronic pain during or after times of stress or unhappiness.\nPeople can also experience chronic pain even after usual medical tests don’t provide an answer.\nWhat can I do for myself?\nThere’s a lot you can do to help yourself and have a better life even with chronic pain. Simple changes can often make a big difference to the amount of disability and suffering you can experience. This is called pain management.\nTo help manage your pain, you might consider:\n\nPlanning your day - Make a plan of things to do and places to be to help you keep on top of your pain.\nPacing yourself - Don’t push through the pain, stop before it gets worse then go back to whatever you were doing later.\nLearning to relax - Relaxing can be hard when you have pain but finding something which relaxes you will reduce the stress of pain.\nTaking regular enjoyable exercise - Even a small amount will make you feel better and ease your pain. It will also keep your muscles and joints strong.\nTaking pain medicine - Pain medicines work better alongside a plan. Patients often say their pain medicines don’t seem to work very well.\nTalking to others - Tell your friends and family about chronic pain and why you need to do things differently at the moment.\nEnjoyment - Doing things you enjoy boosts your own natural painkillers. Think about what you enjoyed before the pain and introduce it back into your routin\n\nActivity and exercise\nBeing active and taking exercise is a good prescription for managing pain. Knowing where to start can be daunting for some people with chronic pain as they often find it hard to do things on some days more than others. Don’t be put off by the word ‘exercise’ - any type of movement is exercise.\nTo begin with your muscles might hurt so it's important that you choose a level of exercise that suits you. Learning how to ‘pace’ your activity and exercise can help. Most of all it should be enjoyable.\nWalking\nThis might start off with walk up and down your path or a walk to the end of the street and back. A local park is also a good option, especially if it has benches for you to rest on along the way.\nIf you feel able to walk further, joining a local walking group is a good way to keep active and motivated. Some of these groups are run by local councils and offer different levels of difficulty for beginners and upwards. You can also find walking groups through Ramblers Scotland.\nDancing or moving to music\nDancing or moving to music, either sitting down or standing up (or a mixture of both), is a great way to exercise.\nExercising in the pool\nYou don’t need to know how to swim to be able to exercise in a swimming pool. The buoyancy of the water makes us feel lighter. This can make movement and exercise easier than on dry land.\nSpend 10 to 15 minutes in the water to begin with. Slow movements are best. If you don’t swim take someone with you and stay close to the side.\nExercise classes\nIf you'd prefer to exercise with others, you can find out about exercises classes from your local sports centre. Classes range in difficulty so remember to ask what level of exercise each class offers.\nExercise referral schemes\nMany health care professionals can refer patients to exercise programmes that have been designed to help people become more active.\nThese programmes are often based at local sport centres with specialists available to give advice and help to design an exercise programme that meets your needs.\nAsk your GP or any health care professional about programmes available in your area.\nTranscutaneous electrical nerve stimulation (TENS)\nA TENS machine is a simple way of blocking pain signals using self-adhesive pads to pass an electric current through the skin. It’s a bit like rubbing the sore bit better or using a hot water bottle to provide comfort.\nYou can buy TENS machines from pharmacists, supermarkets or online. Prices start from £8.99 for a simple machine. You shouldn’t need to spend more than £30 to get a machine with 2 sets of pads and a fully adjustable pulse rate and width.\nMore about TENS for pain relief from Pain Concern\nDealing with stress and depression\nWhen the body feels under threat it produces stress hormones that make us feel anxious and tense. The body sees pain as a threat and when it's persistent or chronic, it can make us feel unwell.\nRelaxation\nFinding a way to relax can help to reduce pain. Anything which makes you feel good, you enjoy or gives you pleasure is a form of relaxation.\nHobbies and activities may have taken a backseat due to your pain, but it's worth thinking about how to get back to doing things you enjoy. Anything that helps you to focus on things other than your pain is a good form of self-management.\nLearn some relaxation techniques\nDepression\nEffective pain management tackles all aspects of your life affected by chronic pain - including your mental wellbeing.\nMore about low mood and depression\nPain medication\nPain medication can help to reduce your pain and keep you moving. In some cases they won't be effective at treating your pain and can cause side effects.\nIf you're already taking medication or have other health problems, it's important to check with your pharmacist before taking any non-prescription pain medication.\nPharmacists are a great source of information about chronic pain and medication.\nWhen should I see my doctor?\nIf you're still in pain after 12 weeks, speak to your GP if you haven't already done so. Your GP will be able to tell you the best plan for managing your pain.\n"}, {"Name": "Living Well With Coeliac Disease", "Cure": "\nLiving with coeliac disease can be challenging but with the right support and information, it's completely manageable.\n\nThere are some things you can do which will help you cope better with your condition and diet. These include:\n\nseeing a dietitian and getting a step by step plan for removing gluten from your diet, and living a gluten free lifestyle\nlearning which foods are naturally gluten free\njoining the Gluten-free Food Service to access gluten free products on prescription through your local pharmacy, including an annual health check\napproaching the gluten free manufacturers and asking for free sample packs to be sent to you to try\ntalking to other people with coeliac disease\nchecking out your local supermarkets and the internet for gluten free products and information to help you shop and eat a gluten free diet at home\njoining a support group\n\nMaking small changes to your daily diet and mindset will have a big impact on managing your condition. Read more hints and tips on how to live well with coeliac disease.\nFollowing a lifelong gluten free diet may seem daunting at first but it does not mean you can’t enjoy food, and the social aspects of food, like everyone else.\nSupport groups\nThere is a large community of people with coeliac disease and charities such as Coeliac UK who exist to help give you the information and support needed to understand coeliac disease and adapt to a gluten free diet, including access to local support groups in your area.\nJoining your local coeliac disease support group is a good way to meet people who really understand what you are going through. They can help give you advice on how to live well with coeliac disease and support you whilst you're adapting to your new lifestyle.\nTo find your nearest coeliac disease support group, visit Coeliac UK.\nMore about Simon's story - using a support group\n"}, {"Name": "Cold Sore", "Cure": "\nCold sores are small blisters that develop on the lips or around the mouth. They're caused by the herpes simplex virus and usually clear up without treatment within 7 to 10 days.\nYou may not have any symptoms when you first become infected with the herpes simplex virus. An outbreak of cold sores may happen some time later.\nCold sores often start with a tingling, itching or burning sensation around your mouth. Small fluid-filled sores then appear, usually on the edges of your lower lip.\nRead more about the symptoms of cold sores.\nWhen to get professional advice\n \n"}, {"Name": "Constipation", "Cure": "\nConstipation is a common condition that affects people of all ages. It can mean that you're not passing stools regularly or you're unable to completely empty your bowel.\nConstipation can also cause your stools to be hard and lumpy, as well as unusually large or small.\nThe severity of constipation varies from person to person. Many people only experience constipation for a short time, but for others, constipation can be a long-term (chronic) condition that causes significant pain and discomfort and affects quality of life.\nRead more about the symptoms of constipation.\nWhat causes constipation?\nIt's often difficult to identify the exact cause of constipation. However, there are a number of things that contribute to the condition, including:\n\nnot eating enough fibre, such as fruit, vegetables and cereals\na change in your routine or lifestyle, such as a change in your eating habits\nignoring the urge to pass stools\nside effects of certain medications\nnot drinking enough fluids\nanxiety or depression\n\nIn children, poor diet, fear about using the toilet and problems toilet training can all lead to constipation.\nRead more about the causes of constipation.\nWho's affected\nConstipation can occur in babies, children and adults. It's estimated that around 1 in every 7 adults and up to 1 in every 3 children in the UK has constipation at any one time.\nThe condition affects twice as many women as men and is also more common in older adults and during pregnancy.\nWhen to get professional advice\n"}, {"Name": "Living Well With Copd", "Cure": "\nLiving with COPD can be difficult but it doesn't have to mean your working life or social life are over.\nSimple self management techniques can help you cope better with your condition. These include:\n\nlearning to control your breathing\nbeing mindful of fatigue and over exertion in your daily activities\ngoing to a pulmonary rehab centre\ngetting your annual flu vaccine\ntaking your prescribed medication regularly\npacing yourself\neating a healthy, well balanced diet\n\nLiving with COPD will be challenging at times but you can make small changes to your daily routine and mindset which will have a big impact on your quality of life. Read more hints and tips on how to live well with COPD.\nSupport groups\n\nMany people find having a long term condition or \"invisible condition\" isolating, and the changes in their situation can lead them to withdraw from work and social life. This can have a serious impact on your mental wellbeing.\nJoining your local COPD support group is a good way to meet people who really understand what you are going through. They can help give you advice on how to live well with COPD and support you through difficult times.\nMany groups also offer outings, social occasions and hobby classes such as singing or walking. To find your nearest COPD support group use our Service Directory.\nPulmonary Rehabilitation\nMany people find pulmonary rehabilitation very useful to learn about helpful techniques to manage COPD. Ask your health care professional about pulmonary rehabilitation, it can teach you useful methods such as pursed lip breathing to help with shortness of breath.\n"}, {"Name": "Cough", "Cure": "\nA cough is a reflex action to clear your airways of mucus and irritants such as dust or smoke. It's rarely a sign of anything serious. \nMost coughs clear up within 3 weeks and don't require any treatment.\nA dry cough means it's tickly and doesn't produce any phlegm (thick mucus). A chesty cough means phlegm is produced to help clear your airways.\n"}, {"Name": "Dehydration", "Cure": "\nDehydration occurs when your body loses more fluid than you take in.\nWhen the normal water content of your body is reduced, it upsets the balance of minerals (salts and sugar) in your body, which affects the way it functions.\nWater makes up over two-thirds of the healthy human body. It lubricates the joints and eyes, aids digestion, flushes out waste and toxins, and keeps the skin healthy.\nSome of the early warning signs of dehydration include:\n\nfeeling thirsty and lightheaded\na dry mouth\ntiredness\nhaving dark coloured, strong-smelling urine\npassing urine less often than usual\n\nA baby may be dehydrated if they:\n\nhave a sunken soft spot (fontanelle) on their head\nhave few or no tears when they cry\nhave fewer wet nappies\nare drowsy\n\nThe body is affected even when you lose a small amount of fluid.\nRead more about the symptoms of dehydration\nWhat causes dehydration?\nDehydration is usually caused by not drinking enough fluid to replace what we lose. The climate, the amount of physical exercise you are doing (particularly in hot weather) and your diet can contribute to dehydration.\nYou can also become dehydrated as a result of an illness, such as persistent vomiting and diarrhoea, or sweating from a fever.\nRead more about the causes of dehydration\nWho is at risk from dehydration?\nAnyone can become dehydrated, but certain groups are particularly at risk. These include:\n\nbabies and infants – they have a low body weight and are sensitive to even small amounts of fluid loss\nolder people – they may be less aware that they are becoming dehydrated and need to keep drinking fluids\npeople with a long-term health condition – such as diabetes or alcoholism\nathletes – they can lose a large amount of body fluid through sweat when exercising for long periods \n\nWhat to do\nIf you're dehydrated, drink plenty of fluids such as water, diluted squash or fruit juice. These are much more effective than large amounts of tea or coffee. Fizzy drinks may contain more sugar than you need and may be harder to take in large amounts.\nIf you're finding it difficult to keep water down because you're vomiting, try drinking small amounts more frequently.\nInfants and small children who are dehydrated shouldn't be given large amounts of water alone as the main replacement fluid. This is because it can dilute the already low level of minerals in their body too much and lead to other problems.\nInstead, they should be given diluted squash or a rehydration solution (available from pharmacies). You might find a teaspoon or syringe can be helpful for getting fluid into a young child.\nIf left untreated, severe dehydration can be serious and cause fits (seizures), brain damage and death.\nRead more about treating dehydration\nWhen to see your GP\nSee your GP if your symptoms continue, despite drinking plenty of fluids, or if you think your baby or toddler is dehydrated.\nIf your GP suspects dehydration, you may have a blood test or a urine test to check the balance of salts (sodium and potassium) in your body.\nContact your GP, out-of-hours service or NHS 24 111 service straight away if you have any of the following symptoms:\n\nextreme thirst\nfeeling unusually tired (lethargic) or confused\nnot passing urine for eight hours\nrapid heartbeat\ndizziness when you stand up that doesn't go away after a few seconds\n\nYou should also contact your GP if your baby has had six or more episodes of diarrhoea in the past 24 hours, or if they have vomited three times or more in the past 24 hours. \n"}, {"Name": "Dizziness Lightheadedness", "Cure": "\nDizziness is a common symptom that’s not usually a sign of anything serious, but should be investigated by a doctor.\nThe term \"dizziness\" means different things to different people – some use it to describe feeling lightheaded or off balance, while others use it to describe a feeling that their surroundings are spinning.\nBecause the symptom is quite vague and can be caused by a wide range of things, it may not always be easy to identify the underlying cause of dizziness.\nThis page explains what you should do if you feel dizzy for no apparent reason, and outlines the most common causes.\nSeeing your GP \nSee your GP if you're feeling lightheaded or off balance and you're worried, particularly if you also have other symptoms, such as fainting episodes or headaches.\nYour GP will first want to establish exactly what you mean by dizziness, and check that you're not actually describing vertigo – a severe type of dizziness, where you feel your surroundings are spinning or moving.\nThey’ll also want to know:\n\nwhether the dizziness started for no apparent reason, or if it followed an illness\nwhether you have repeated episodes of dizziness and, if so, when you tend to experience these\nhow long the dizziness lasts\n\nDizziness can sometimes be caused by an ear condition. A simple way of distinguishing between ear-related dizziness and dizziness due to other causes is to determine whether it occurs only when you're upright or also when you're lying down.\nDizziness that occurs when you're upright is probably not related to the ear. Dizziness that happens when you're lying down is usually caused by a viral ear infection, which can't be treated with antibiotics.\nIt’s a good idea to keep a diary of your dizziness, recording when and where you experience the problem, and take it with you to your GP appointment. It's helpful to note:\n\nwhat you were doing at the time of your dizziness\nhow long it lasted and how bad it was\nwhether you had any other symptoms – such as fainting, vomiting, nausea, blurred vision, headache, hearing loss or tinnitus\n\nIf you're taking prescription medicine, your GP will probably review this to check whether dizziness is a possible side effect. If necessary, they can prescribe a different medication for you to try.\nYou may be referred to a specialist for further tests and investigations.\nCommon causes of dizziness\nThe most common causes of dizziness are outlined below.\n\nLabyrinthitis – an inner ear infection that affects your hearing and balance, and can lead to a severe form of dizziness called vertigo.\nMigraine – dizziness may come on before or after the headache, or even without the headache.\nStress or anxiety – particularly if you tend to hyperventilate (breathe abnormally quickly when resting).\nLow blood sugar level (hypoglycaemia) – which is usually seen in people with diabetes.\nPostural hypotension – a sudden fall in blood pressure when you suddenly sit or stand up, which goes away after lying down. This is more common in older people.\nDehydration or heat exhaustion – dehydration could be due to not drinking enough during exercise, or illness that causes vomiting, diarrhoea or fever.\nVertebrobasilar insufficiency – decreased blood flow in the back of the brain, which may be caused by the blood vessels that lead to the brain from the heart being blocked (known as atherosclerosis).\n\nLess common causes of dizziness\nLess common causes of dizziness include:\n\nhaving a severe illness or condition that affects the whole body\nusing recreational drugs or consuming excessive amounts of alcohol (either binge drinking or long-term alcohol misuse)\ncertain types of prescription medicine – such as antidepressants or blood pressure medication\nhaving a heart rhythm problem – such as atrial fibrillation (a fast, irregular heartbeat)\ncarbon monoxide poisoning\n\n"}, {"Name": "Dry Mouth", "Cure": "\nIt's normal to occasionally have a dry mouth if you’re dehydrated or feeling nervous, but a persistently dry mouth can be a sign of an underlying problem.\nYou should see your dentist or GP if you have an unusually dry mouth (known as xerostomia) so they can try to determine the cause.\nWhat can cause a dry mouth?\nA dry mouth can occur when the salivary glands in your mouth don't produce enough saliva.\nThis is often the result of dehydration, which means you don’t have enough fluid in your body to produce the saliva you need. It's also common for your mouth to become dry if you're feeling anxious or nervous.\nA dry mouth can sometimes be caused by an underlying problem or medical condition, such as:\n\nmedication – many different medications can cause a dry mouth, including antidepressants, antihistamines and diuretics; check the leaflet that comes with your medicine, or find it in the medicines section to see if dry mouth is listed as a side effect\na blocked nose – breathing through your mouth while you sleep can cause it to dry out\ndiabetes – a lifelong condition that causes a person's blood sugar level to become too high\nradiotherapy to the head and neck – this can cause the salivary glands to become inflamed (mucositis)\nSjögren's syndrome – a condition where the immune system attacks and damages the salivary glands\n\nIf you see your dentist or GP, let them know about any other symptoms you're experiencing and any treatments you’re having, as this will help them work out why your mouth is dry.\nWhat problems can a dry mouth cause?\nSaliva plays an important role in keeping your mouth healthy. If you have a dry mouth, you may experience a number of other problems too, such as:\n\na burning sensation or soreness in your mouth\ndry lips\nbad breath (halitosis)\na decreased or altered sense of taste\nrecurrent mouth infections, such as oral thrush\ntooth decay and gum disease\ndifficulty speaking, eating or swallowing\n\nIt’s important to maintain good oral hygiene if you have a dry mouth to reduce the risk of dental problems. You should also see a dentist regularly, so they can identify and treat any problems early on.\nTreating a dry mouth\nTreating the underlying cause\nIf your doctor or dentist is able to determine what's causing your dry mouth, treating this may improve your symptoms.\nFor example, if medication is suspected as the cause of your dry mouth, your doctor may reduce your dose or suggest trying an alternative medication.\nSome of the conditions mentioned above have specific treatments, such as nasal decongestants for a blocked nose and insulin for diabetes.\nThings to try yourself\nThere are simple measures you can try to help keep your mouth moist. For example, it may help to:\n\nincrease your fluid intake – take regular sips of cold water or an unsweetened drink\nsuck on sugar-free sweets or chew sugar-free gum – this can stimulate your salivary glands to produce more saliva\nsuck on ice cubes – the ice will melt slowly and moisten your mouth\navoid alcohol (including alcohol-based mouthwashes), caffeine and smoking – these can all make a dry mouth worse\n\nSaliva substitutes and stimulants\nIf the measures above don’t help, your dentist, GP or specialist may suggest using an artificial saliva substitute to keep your mouth moist. This may come in the form of a spray, gel or lozenge. Use it as often as you need to, including before and during meals.\nIf your dry mouth is caused by radiotherapy or Sjögren's syndrome, a medication called pilocarpine may be prescribed. This is taken as a tablet several times a day to help stimulate your salivary glands to produce more saliva.\nHowever, pilocarpine isn't suitable for everyone, as it may cause side effects, such as sweating or headaches.\n"}, {"Name": "Earache", "Cure": "\nEarache is a common problem, particularly in children. It can be worrying, but it's usually only caused by a minor infection and will often get better in a few days without treatment.\nEarache can be a sharp, dull or burning ear pain that comes and goes or is constant. One or both ears may be affected.\nWhen should I contact my GP?\nIt's not always necessary to see your GP if you or your child have earache. Your local pharmacist is always on hand to offer help and advice on how you can manage the problem. The pain will often improve in a few days and there are things you can do to help in the meantime.\nYou should contact your GP or local out-of-hours service if:\n\nyou or your child also have other symptoms, such as a high temperature (fever), vomiting, a severe sore throat, hearing loss, swelling around the ear, or discharge from the ear\nthere is something stuck in your or your child's ear\nthe earache doesn't improve within a few days\n\nTo assess your condition at home use our earache self-help guide.\n"}, {"Name": "Elbow Problems", "Cure": "\nElbow problems can cause a range of symptoms including pain, swelling and stiffness.\nIn many cases, new or flare-up of long-standing elbow problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nSpeak to a healthcare professional as soon as possible if:\n\nthere's been significant trauma, for example a fall from height or direct blow to the elbow\nyou can't move your elbow at all\n\nWhat causes elbow problems?\nElbow problems can be the result of an injury from sport or due to repetitive movements of the elbow. It may also be due to a flare-up of an existing problem\nProblems on the outside of your elbow are often called tennis elbow, and on the inside, golfers elbow.\nCan this cause problems anywhere else?\nYou may feel some pain in the muscles around your elbow and down to your wrist. You may also have altered feeling into your fingers. These should improve as your elbow problem gets better.\nSelf-help\nKeeping your elbow moving is an essential part of your treatment and recovery. Keeping active is the single best thing you can do for your general health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you have less discomfort and good movement.\nExercises to help with elbow problems\nResting or moving?\nWithin the first 24 to 48 hours after an elbow injury you should try to:\n\nrest your elbow but avoid long spells of not moving at all\nmove your elbow gently for 10 to 20 seconds every hour when you are awake\n\nAfter 48 hours:\n\ntry to use your arm more - exercise really helps your elbow and can relieve pain\ndo whatever you normally would and stay at, or return to work - this is important and is the best way to get better\n\nYou may need to adapt how you do things in the first hours and days.\nPain treatments\nPain medication can help to reduce the pain and help you move more comfortably, which can help your recovery.\nSpeak to your community pharmacist or other healthcare professional about taking medication or other methods of pain relief. It's important to take medication regularly.\nMore about taking painkillers\nWork\nIt's recommended you stay at or return to work as quickly as possible during your recovery. You don't need to be pain and symptom-free to return to work.\nHelp and support\nIf, after following the above advice, your elbow problem hasn't improved within 6 weeks a referral to a physiotherapist may be of benefit.\nIf available in your health board area, the Musculoskeletal (MSK) Helpline can refer you to a healthcare professional if you need it.\n"}, {"Name": "Fever In Children", "Cure": "\nA fever is a high temperature. As a general rule, in children a temperature of over 37.5C (99.5F) is a fever.\nAs a parent it can be extremely worrying if your child has a high temperature. However, it's very common and often clears up by itself without treatment. \nA quick and easy way to find out whether your child has a fever is to take their temperature using a thermometer.\nWhat causes a high temperature?\nMost fevers are caused by infections or other illnesses. The high body temperature makes it more difficult for the bacteria and viruses that cause infections to survive.\nCommon conditions that can cause fevers include:\n\nupper respiratory tract infections (RTIs)\nflu\near infections\nroseola – a virus that causes a temperature and a rash \ntonsillitis\nkidney or urinary tract infections (UTIs)\ncommon childhood illnesses, such as chickenpox and whooping cough\n\nYour child's temperature can also be raised after vaccinations, or if they overheat because of too much bedding or clothing.\nWhen to seek urgent medical advice\nContact your GP or health visitor urgently if your child:\n\nis under three months old and has a temperature of 38C (101F) or above\nis between three and six months old and has a temperature of 39C (102F) or above\n\nYou should also see your GP if your child has other signs of being unwell, such as persistent vomiting, refusal to feed, floppiness or drowsiness.\nIf it isn't possible to contact your GP, call your local out-of-hours service or phone NHS 24's 111 service.\nIf your child seems to be otherwise well – for example, if they're playing and attentive – it's less likely they're seriously ill. \n"}, {"Name": "Flatulence", "Cure": "\nFlatulence is passing gas from the digestive system out of the back passage. It's more commonly known as \"passing wind\", or \"farting\".\nFarting is often laughed about, but excessive flatulence can be embarrassing and make you feel uncomfortable around others. However, it can usually be controlled with changes to your diet and lifestyle.\nFlatulence is a normal biological process and is something everyone experiences regularly. Some people pass wind only a few times a day, others a lot more, but the average is said to be about 5 to 15 times a day.\nWhy it happens\nWhen you swallow food, water or saliva, you also swallow small amounts of air, which collects in the digestive system. Gases can also build up when you digest food. The body needs to get rid of the build-up by farting (flatulence) or burping (belching).\nSometimes you may not notice you have passed wind because most of the gases are odourless and often released in small quantities. Flatulence usually only has a bad smell if it contains gases that smell, such as sulphur. However, it's important to remember it's normal for the gas you pass to sometimes smell a bit.\nExcessive flatulence can be caused by swallowing more air than usual or eating food that's difficult to digest. It can also be related to an underlying health problem affecting the digestive system, such as recurring indigestion or irritable bowel syndrome (IBS).\nRead more about the causes of flatulence.\nWhen to see your GP\nThere are no medical guidelines defining the normal frequency or volume of flatulence. You're probably the best person to assess your own symptoms.\nSee your GP if your flatulence is particularly troublesome – for example, if you're frequently passing smelly gas.\nYou should also visit your GP if you experience additional symptoms, such as:\n\npersistent abdominal pain and bloating\nrecurring episodes of diarrhoea or constipation\nunexplained weight loss\nbowel incontinence \nblood in your stools (faeces)\nsigns of an infection, such as a high temperature, vomiting, chills, joint pain and muscle pain\n\nThese symptoms could be an indicator of a more serious health problem and may require investigation, such as a blood or stool test to look for an infection.\nControlling the problem\nExcessive flatulence can usually be controlled by making changes to your diet and lifestyle, such as:\n\navoiding foods known to cause flatulence\neating smaller and more frequent meals\neating and drinking slowly\nexercising regularly\n\nThere are also some over-the-counter medications that can help if your flatulence is troublesome, such as charcoal tablets or simethicone.\nIf your flatulence is related to an underlying health problem, treating the condition may help resolve it.\nRead more about treating flatulence.\n"}, {"Name": "Flu", "Cure": "\nFlu (influenza) is a common infectious viral illness spread by coughs and sneezes. It can be very unpleasant, but you'll usually begin to feel better within about a week.\nYou can catch flu all year round, but it's especially common in winter, which is why it's also known as seasonal flu.\nFlu isn't the same as the common cold. Flu is caused by a different group of viruses and the symptoms tend to start more suddenly, be more severe and last longer.\nFlu symptoms\nSome of the main symptoms of flu include:\n\na high temperature (fever) of 38C (100.4F) or above\ntiredness and weakness\na headache\ngeneral aches and pains\na dry, chesty cough\n\nCold-like symptoms, such as a blocked or runny nose, sneezing, and a sore throat, can also be caused by flu, but they tend to be less severe than the other symptoms you have.\nFlu can make you feel so exhausted and unwell that you have to stay in bed and rest until you feel better.\nRead more about the symptoms of flu\n"}, {"Name": "Foot Problems", "Cure": "\nFoot problems can cause a range of symptoms including pain, swelling and limping.\nIn many cases, new or flare-up of long-standing foot problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nSpeak to a healthcare professional as soon as possible if:\n\nthere's been significant trauma, for example a fall from height or direct blow to the foot\nyou have a significant open wound\nyou can't put any weight at all through your foot\n\nWhat causes foot problems?\nFoot problems are fairly common and can be caused by injury or normal age-related changes. It may also be due to a flare-up of an existing problem.\nAs you get older, normal age-related changes can cause your foot problem to flare-up now and again, often for no reason.\nCan this cause problems anywhere else?\nYou may feel some pains in your toes, ankle, calf, knee and even in your back. This should improve as your foot problem gets better.\nFoot problems can also cause limping. If the limp is severe, using a walking stick on the opposite side to your foot problem may help.\nHow to use a walking stick\nSelf-help\nKeeping active is an essential part of your treatment and recovery and is the single best thing you can do for your health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none.\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you have less discomfort and good movement.\nExercises to help with foot problems\nResting or moving?\nWithin the first 24 to 48 hours of symptoms starting you should try to:\n\nrest your foot, but avoid long spells of not moving at all\nmove your foot and toes gently for 10 to 20 seconds every hour when you're awake\n\nAfter 48 hours:\n\ntry to slowly return to normal activity\ndo whatever you normally would and stay at or return to work - this is important and is the best way to get better\nlead with your good leg when going upstairs to reduce the strain on your foot\nlead with your problem leg when going downstairs to reduce the strain on your foot\nuse a handrail (if available) when going up and downstairs\n\nPain treatments\nPain medication can help to reduce the pain and help you move more comfortably, which can help your recovery.\nSpeak to your community pharmacist or other healthcare professional about taking medication or other methods of pain relief. It's important to take medication regularly.\nMore about taking painkillers\nWork\nIt's recommended you stay at or return to work as quickly as possible during your recovery. You don't need to be pain and symptom-free to return to work.\nHelp and support\nIf, after following the above advice, your foot problem hasn't improved within 6 weeks a referral to a physiotherapist or podiatrist may be of benefit.\nIf available in your health board area, the Musculoskeletal (MSK) Helpline can refer you to a healthcare professional if you need it.\n"}, {"Name": "Hay Fever", "Cure": "\nHay fever is a common allergic condition that affects up to one in five people at some point in their life.\nSymptoms of hay fever include:\n\nsneezing\na runny nose\nitchy eyes\n\nYou'll experience hay fever symptoms if you have an allergic reaction to pollen.\nPollen is a fine powder released by plants as part of their reproductive cycle. It contains proteins that can cause the nose, eyes, throat and sinuses (small air-filled cavities behind your cheekbones and forehead) to become swollen, irritated and inflamed.\nYou can have an allergy to:\n\ntree pollen, released during spring\ngrass pollen, released during the end of spring and beginning of summer\nweed pollen, released late autumn\n\nRead more about the causes of hay fever.\nMany people find their symptoms improve as they get older. Around half of people report some improvement in symptoms after several years. Symptoms disappear completely in around 10-20% of people.\n"}, {"Name": "Headaches", "Cure": "\nMore than 10 million people in the UK get headaches regularly, making them one of the most common health complaints. But most aren't serious and are easily treated.\nIn many cases, you can treat your headaches at home with over-the-counter painkillers and lifestyle changes, such as getting more rest and drinking enough fluids.\nWhen to get professional advice\n"}, {"Name": "Hearing Loss", "Cure": "\nHearing loss is a common problem that often develops with age or is caused by repeated exposure to loud noises.\nAction on Hearing Loss estimates that there are more than 10 million (about 1 in 6) people in the UK with some degree of hearing impairment or deafness.\nHearing loss can occur suddenly, but usually develops gradually. General signs of hearing loss can include:\n\ndifficulty hearing other people clearly and misunderstanding what they say\nasking people to repeat themselves\nlistening to music or watching television with the volume turned up higher than other people require\n\nRead more about the symptoms of hearing loss\nWhen to see your GP\nSee your GP if you're having problems with your hearing, or your child is showing signs of hearing difficulty. If you lose your hearing suddenly, in one or both ears, you must see your GP as soon as possible.\nYour GP can check for any problems and may refer you to an audiologist (hearing specialist) or an ENT surgeon for further tests.\nYou can also visit the Action on Hearing Loss website for an online hearing test.\nRead more about diagnosing hearing loss\nWhy it happens\nHearing loss is the result of sound signals not reaching the brain. There are two main types of hearing loss, depending on where the problem lies:\n\nsensorineural hearing loss – caused by damage to the sensitive hair cells inside the inner ear or damage to the auditory nerve; this occurs naturally with age or as a result of injury\nconductive hearing loss – when sounds are unable to pass from your outer ear to your inner ear, often because of a blockage such as earwax, glue ear or a build-up of fluid from an ear infection, or because of a perforated ear drum or disorder of the hearing bones\n\nIt's also possible to have both these types of hearing loss. This is known as mixed hearing loss.\nSome people are born with hearing loss, but most cases develop as you get older. \nRead more about causes of hearing loss\nPreventing hearing loss\nIt isn't always possible to prevent hearing loss if you have an underlying condition that causes you to lose your hearing.\nHowever, there are several things you can do to reduce the risk of hearing loss from long-term exposure to loud noise. This includes not having music or the television on at a loud volume at home and using ear protection at loud music events or in noisy work environments.\nYou should also see your GP if you have signs of an ear infection, such as flu-like symptoms, severe earache, discharge or hearing loss.\nRead more about preventing hearing loss\nTreating hearing loss\nThe way hearing loss is treated depends on the cause and how severe it is.\nIn cases of sensorineural hearing loss, there are several options that may help to improve a person’s ability to hear and communicate. These include:\n\ndigital hearing aids – which are available through the NHS\nbone anchored implants – suitable for people who are unable to use hearing aids and for some levels of sensorineural hearing loss\nmiddle ear implants – suitable for some people who are unable to use hearing aids\ncochlear implants – for people who find hearing aids aren't powerful enough\nlip reading and/or sign language – such as British Sign Language (BSL)\n\nConductive hearing loss is sometimes temporary and can be treated with medication or minor surgery, if necessary. However, more major surgery may be required to fix the ear drum or hearing bones. If conventional hearing aids don't work, there are also some implantable devices for this type of hearing loss, such as a Bone Anchored Hearing Aids (BAHAs).\nRead more about treating hearing loss\n"}, {"Name": "Heart Palpitations", "Cure": "\nHeart palpitations are heartbeats that can become noticeable.\nYou may or may not develop other symptoms at the same time. For example, your heart might feel like it's pounding, fluttering or beating irregularly, often for just a few seconds or minutes. You may also feel these sensations in your throat or neck.\nPalpitations might feel alarming but keep in mind that in most cases they aren't a sign of any problems with your heart. However, you should always get palpitation symptoms checked out with your GP or health professional.\nYou may sometimes feel that your heart skips a beat or there is an extra beat. This is known medically as an ectopic beat. It's very common and usually nothing to worry about.\nWhen to get immediate medical help\nSometimes palpitations may be a sign of a heart problem. It's important to seek immediate medical assistance or call 999 if you are experience other symptoms such as:\n\ndizziness\nbreathlessness or shortness of breath\nchest pain\n\n"}, {"Name": "Hip Problems", "Cure": "\nHip problems can cause a range of symptoms including pain, stiffness and weakness.\nIn many cases, new or flare-up of long-standing hip problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nSpeak to a healthcare professional as soon as possible if:\n\nthere's been significant trauma, for example a fall from height or direct blow to the hip\nyou can't put any weight at all through your leg\nyou have a lump in your groin region as this may be a hernia\nyou feel pain or swelling around your testicles\n\nWhat causes hip problems?\nHip problems can be caused by injury or normal age-related changes.\nAs you get older normal age-related changes can cause your hip problem to flare-up now and again, often for no reason.\nCan this cause problems anywhere else?\nYou may feel some pain in the buttock, groin, back, thigh or knee.\nSelf-help\nKeeping active is an essential part of your treatment and recovery and is the single best thing you can do for your health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you've less discomfort and good movement. Remember to fully warm up before you start to exercise.\nExercises to help with hip problems\nResting or moving?\nWithin the first 24 to 48 hours after your hip problem starts you should try to:\n\nrest your hip but avoid long spells of not moving at all\nmove your hip gently for a short period every hour when you are awake\n\nAfter 48 hours:\n\ntry to slowly return to normal activity\ndo whatever you normally would and stay at, or return to work - this is important and is the best way to get better\nlead with your good leg when going upstairs to reduce the strain on your hip\nlead with your problem leg when going downstairs to reduce the strain on your hip\nuse a handrail (if available) when going up and downstairs\n\nPain treatments\nPain medication can help to reduce the pain and help you move more comfortably, which can help your recovery.\nSpeak to your community pharmacist or other healthcare professional about taking medication or other methods of pain relief. It's important to take medication regularly.\nMore about taking painkillers\nWork\nIt's recommended you stay at or return to work as quickly as possible during your recovery. You don't need to be pain and symptom-free to return to work.\nHelp and support\nIf, after following the above advice, your hip problem hasn't improved within 6 weeks a referral to a physiotherapist may be of benefit.\nIf available in your health board area, the Musculoskeletal (MSK) Helpline can refer you to a healthcare professional if you need it.\n"}, {"Name": "Bowel Incontinence", "Cure": "\nBowel incontinence is an inability to control bowel movements, resulting in involuntary soiling. It's also sometimes known as faecal incontinence.\nThe experience of bowel incontinence can vary from person to person. Some people feel a sudden need to go to the toilet but are unable to reach a toilet in time. This is known as urge bowel incontinence.\nOther people experience no sensation before soiling themselves, known as passive incontinence or passive soiling, or there might be slight soiling when passing wind.\nSome people experience incontinence on a daily basis, whereas for others it only happens from time to time.\nIt's thought 1 in 10 people will be affected by it at some point in their life. It can affect people of any age, although it's more common in elderly people. It's also more common in women than men.\nWhy bowel incontinence happens\nBowel incontinence is a symptom of an underlying problem or medical condition.\nMany cases are caused by diarrhoea, constipation, or weakening of the muscle that controls the opening of the anus.\nIt can also be caused by long-term conditions such as diabetes, multiple sclerosis and dementia.\nRead more about the causes of bowel incontinence.\nSeeking advice and treatment\nBowel incontinence can be upsetting and hard to cope with, but treatment is effective and a cure is often possible, so make sure you see your GP.\nIt's important to remember that:\n\nBowel incontinence isn't something to be ashamed of – it's simply a medical problem that's no different from diabetes or asthma.\nIt can be treated – there's a wide range of successful treatments.\nBowel incontinence isn't a normal part of ageing.\nIt won't usually go away on its own – most people need treatment for the condition.\n\nIf you don't want to see your GP, you can usually make an appointment at your local NHS continence service without a referral. These clinics are staffed by specialist nurses who can offer useful advice about incontinence.\nRead more about diagnosing bowel incontinence.\nHow bowel incontinence is treated\nIn many cases, with the right treatment, a person can maintain normal bowel function throughout their life.\nTreatment will often depend on the cause and how severe it is, but possible options include:\n\nlifestyle and dietary changes to relieve constipation or diarrhoea\nexercise programmes to strengthen the muscles that control the bowel\nmedication to control diarrhoea and constipation\nsurgery, of which there are a number of different options\n\nIncontinence products, such as anal plugs and disposable pads, can be used until your symptoms are better controlled.\nEven if it isn't possible to cure your bowel incontinence, symptoms should improve significantly.\nRead more about treating bowel incontinence.\n"}, {"Name": "Indigestion", "Cure": "\nIndigestion can be pain or discomfort in your upper abdomen (dyspepsia) or burning pain behind the breastbone (heartburn).\nDyspepsia and heartburn may occur together or on their own. Symptoms usually appear soon after eating or drinking.\nCommon associated symptoms include:\n\nfeeling full or bloated\nfeeling sick (nausea)\nbelching\nbringing up (regurgitating) fluid or food into the gullet (oesophagus)\n\nIndigestion is a common problem that affects many people, but in most cases it's mild and only occurs occasionally.\nRead more about the symptoms of indigestion.\nWhy it happens\nIndigestion may be caused by stomach acid coming into contact with the sensitive, protective lining of the digestive system (mucosa). The stomach acid breaks down the lining, leading to irritation and inflammation, which can be painful.\nThe majority of people with indigestion don't have inflammation in their digestive system. Therefore, their symptoms are thought to be caused by increased sensitivity of the mucosa (to acidity or stretching).\nIn most cases indigestion is related to eating, although it can be triggered by other factors such as smoking, drinking, alcohol, pregnancy, stress or taking certain medications.\nRead more about the causes of indigestion.\nTreating indigestion at home\nMost people are able to treat indigestion with simple changes to their diet and lifestyle, or with a number of different medications, such as antacids.\nRead more about the treatment of indigestion.\nVery rarely, a serious underlying health condition is the cause of indigestion. If this is suspected, then further investigation such as an endoscopy will be required (see below).\n"}, {"Name": "Itching", "Cure": "\nItching is an unpleasant sensation that compels a person to scratch the affected area. The medical name for itching is pruritus.\nItching can affect any area of the body. It can either be:\n\ngeneralised – where itching occurs over the whole body\nlocalised – where itching only occurs in a particular area\n\nSometimes, there may be a rash or spot where the itching occurs.\nMild, short-lived itching is common, but the problem can occasionally be severe and very frustrating to live with.\nCommon causes of itching\nItching can be caused by a number of different conditions, including:\n\nskin conditions – such as eczema\nallergies or skin reactions\nparasitic infestations – such as scabies\ninsect bites and stings\nfungal infections – such as athlete’s foot or vaginal thrush\nhormonal changes during pregnancy or the menopause\nsystemic conditions (one that affects the whole body) – such as liver or kidney problems, or an overactive thyroid gland\n\nRead more about the possible causes of itching.\nThings you can do\nIf you experience troublesome itching, there are some things you can do that may help relieve it and prevent damage caused by scratching, including:\n\npatting or tapping the itchy area, rather than scratching it\nholding a cold compress, such as damp flannel, over the affected area to cool it down\nbathing or showering in cool or lukewarm water\nusing unperfumed personal hygiene products\navoiding clothes that irritate your skin, such as wool or man-made fabrics\nusing a moisturiser or emollient if your skin is dry or flaky\n\nThere are also medicines, such as antihistamines and steroid creams, that are available over the counter from pharmacies that may help relieve itching caused by certain skin conditions.\nRead more about treatments to relieve itching.\nWhen to see your GP\nMany cases of itching will get better over a short period of time. However, you should visit your GP if your itch is:\n\nsevere\nlasts for a long time\nkeeps coming back\nassociated with other symptoms – such as redness and swelling or jaundice (yellowing of the skin and whites of the eyes)\n\nYou should also visit your GP if your entire body itches and there is no obvious cause. It could be a symptom of a more serious condition.\nYour GP will ask you about your symptoms – for example, if you have noticed whether anything makes your itch worse, or if your itch comes and goes. They will also examine your skin to look for any visible symptoms.\nIn some cases, they may take a skin scraping or a swab so it can be tested to help identify the cause of your itching. A blood test may also be carried out to look for underlying problems, such as thyroid or kidney disease.\nDepending on what is found to be causing your itch, you may be referred to a hospital specialist for a further assessment and specific treatment. \n"}, {"Name": "Itchy Bottom", "Cure": "\nItchy bottom (pruritus ani) is characterised by a strong urge to scratch the skin around your anus.\nThe anus is the opening at the lower end of the digestive system, where solid waste leaves your body.\nCauses of itchy bottom\nAs itchy bottom is a symptom rather than a condition itself, many cases have an underlying cause, for example:\n\na bacterial infection – such as those that cause streptococcal infections\na skin condition – such as atopic eczema, where the skin becomes red, dry and flaky\nhaemorrhoids (piles) – swellings that contain enlarged and swollen blood vessels in and around the anus\n\nIn children, an itchy bottom is often caused by threadworms.\nBut not all cases of itchy bottom have an identifiable cause.\nAn itchy bottom can be made worse by:\n\nheat\nwoollen clothing or blankets\nmoisture\nsoiling yourself\nstress or anxiety\n\nRead more about the causes of itchy bottom. \nWhen to see your GP\nSee your GP if you've had an itchy bottom for more than a few days, so they can try to find the cause. They may ask about:\n\nhow often you wash and whether you use creams, powders or soaps around your anus\nthe duration and pattern of your itching – such as whether your symptoms are worse at night or after eating certain foods\nother symptoms – such as bleeding or other discharge from your anus\n\nYour GP will usually want to examine the skin around your anus and may ask to carry out a digital rectal examination (DRE) to rule out more serious underlying conditions.\nYou may feel awkward, but it's nothing to be embarrassed or worried about, as this is one of the most common examinations GPs carry out.\nIf necessary, you may be referred to a specialist for further investigation and treatment.\nTreating itchy bottom\nAn itchy bottom is usually easy to treat at home. Some ways of easing an itchy bottom include:\n\nkeeping your bottom clean and dry\navoid using scented soaps\nuse soft toilet tissue\navoid scratching\n\nYour GP can prescribe creams or ointments to help relieve your symptoms while the above self-care measures are taking effect. Check with your GP or pharmacist about how long you should use them for.\nIf your itchy bottom is caused by an underlying condition, such as a bacterial infection or piles, it will also need to be treated.\nRead more about treating an itchy bottom.\nComplications of itchy bottom\nFrequently scratching your bottom may damage or tear the delicate skin around your anus. This may lead to problems such as:\n\nthick and leathery skin (lichenification)\nsore and broken down skin (ulceration)\nthe top layer of skin being worn away (excoriation)\ninfection\n\nThe earlier these complications are diagnosed and treated, the quicker you'll recover. You should visit your GP if the skin around your anus changes or feels painful.\nIf the cause of your itchy bottom can't be identified and treated, it may last for long periods of time (known as chronic itchy bottom). This may cause you to feel embarrassed, anxious or depressed.\nAs the urge to scratch is often worse at night, your sleep may also be disturbed, leaving you feeling tired during the day.\nSpeak to your GP if your itchy bottom is making you anxious or depressed, or if it's significantly affecting your sleep.\n"}, {"Name": "Urinary Incontinence", "Cure": "\nUrinary incontinence is the unintentional passing of urine. It is a common problem and is thought to affect millions of people worldwide.\nIt's not clear exactly how many people are affected, but it's estimated that between 3 and 6 million people in the UK may have some degree of urinary incontinence.\nUrinary incontinence affects both men and women, but it tends to be more common in women overall.\nSigns and symptoms\nThe symptoms of urinary incontinence depend on the type you have.\nThere are several types of urinary incontinence, but the most common are:\n\nstress incontinence – when urine leaks out at times when your bladder is under pressure, for example when you cough or laugh\nurge incontinence – when urine leaks as you feel a sudden, intense urge to pass urine, or soon afterwards\n\nIt is also possible to have a mixture of both stress and urge urinary incontinence.\nRead more about the symptoms of urinary incontinence\nWhat causes urinary incontinence?\nThe causes of urinary incontinence depend on the type.\nStress incontinence is usually the result of the weakening or damaging of the muscles used to prevent urination, such as the pelvic floor muscles and the urethral sphincter.\nUrge incontinence is usually the result of overactivity of the detrusor muscle, which controls the bladder.\nCertain things can increase the chances of urinary incontinence developing, including:\n\npregnancy and vaginal birth\nobesity\na family history of incontinence\nincreasing age – although incontinence is not an inevitable part of ageing\n\nRead more about the causes of urinary incontinence\nSeeking medical advice\nAlthough you may feel embarrassed talking to someone about your symptoms, it's a good idea to see your GP if you have any type of urinary incontinence as this can be the first step towards finding a way to effectively manage the problem.\nUrinary incontinence can usually be diagnosed after a consultation with your GP, who will ask about your symptoms and may carry out a pelvic examination (in women) or rectal examination (in men).\nYour GP may also suggest you keep a diary in which you note how much fluid you drink and how often you have to urinate.\nRead more about diagnosing urinary incontinence\nHow urinary incontinence is treated\nInitially, your GP may suggest some simple measures to see if they help improve your symptoms. These may include:\n\nlifestyle changes, such as losing weight and cutting down on caffeine and alcohol\npelvic floor exercises (exercising your pelvic floor muscles by squeezing them) taught by a specialist\nbladder training (where you learn ways to help you wait longer between needing to urinate and passing urine) guided by a specialist\n\nYou may also benefit from the use of incontinence products, such as absorbent pads and hand-held urinals (urine collection bottles).\nIf you are still unable to manage your symptoms, medication may be recommended.\nSurgery may also be considered. The specific procedures suitable for you will depend on the type of incontinence you have.\nSurgical treatments for stress incontinence, such as tape or sling procedures, are used to reduce pressure on the bladder, or strengthen the muscles that control urination.\nOperations to treat urge incontinence include enlarging the bladder or implanting a device that stimulates the nerve that controls the detrusor muscles.\nRead more about non-surgical treatments for urinary incontinence and surgery and procedures for urinary incontinence\nPreventing urinary incontinence\nIt is not always possible to prevent urinary incontinence, but there are some steps you can take that may help reduce the chance of it developing, such as:\n\ncontrolling your weight\navoiding or cutting down on alcohol\nkeeping fit – in particular, ensuring that your pelvic floor muscles are strong\ntrying to keep your pelvic floor muscles strong\n\nRead more about preventing urinary incontinence\n"}, {"Name": "Knee Problems", "Cure": "\nKnee problems can cause a range of symptoms including pain, stiffness and swelling.\nIn many cases, new or flare-up of long-standing knee problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nPhone 111 as soon as possible if:\n\nyou have difficulty putting any weight at all on your sore leg\nyour knee becomes immediately swollen after a twisting injury\n\nSpeak to a healthcare professional if:\n\nyour knee locks or gives way\nyou have pain that's worsening\n\nWhat causes knee problems?\nKnee problems are common and can be caused by injury, growth spurts or normal age-related changes.\nAs you get older, normal age-related changes can cause your knee problem to flare-up now and again, often for no reason.\nCan this cause problems anywhere else?\nYou may feel some pain in your hip, or the muscles around your thigh or lower leg. This should improve as your knee problem gets better.\nSelf-help\nKeeping active is an essential part of your treatment and recovery and is the single best thing you can do for your health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you have less discomfort and good movement. Remember to warm up fully before you start sporting activities.\nExercises to help with knee problems\nResting or moving?\nWithin the first 24 to 48 hours after your knee problem has started you should try to:\n\nrest your knee but avoid long spells of not moving at all\nmove your knee gently for 10 to 20 seconds every hour when you are awake\n\nAfter 48 hours:\n\ntry to use your leg more - exercise really helps your knee and can relieve pain\ndo whatever you normally would and stay at, or return to work - this is important and is the best way to get better\nlead with your good leg when going upstairs to reduce the strain on your knee\nlead with your problem leg when going downstairs to reduce the strain on your knee\nuse a handrail (if available) when going up and downstairs\n\nPain treatments\nPain medication can help to reduce the pain and help you move more comfortably, which can help your recovery.\nSpeak to your community pharmacist or other healthcare professional about taking medication or other methods of pain relief. It's important to take medication regularly.\nMore about taking painkillers\nWork\nIt's recommended you stay at or return to work as quickly as possible during your recovery. You don't need to be pain and symptom-free to return to work.\nHelp and support\nIf, after following the above advice, your knee problem hasn't improved within 6 weeks a referral to a physiotherapist may be of benefit.\nIf available in your health board area, the Musculoskeletal (MSK) Helpline can refer you to a healthcare professional if you need it.\n"}, {"Name": "Migraine", "Cure": "\nA migraine is usually a moderate or severe headache felt as a throbbing pain on one side of the head.\nMany people also have symptoms such as nausea, vomiting and increased sensitivity to light or sound.\nMigraine is a common health condition, affecting around one in every five women and around one in every 15 men. They usually begin in early adulthood.\nThere are several types of migraine, including:\n\nmigraine with aura – where there are specific warning signs just before the migraine begins, such as seeing flashing lights\nmigraine without aura – the most common type, where the migraine occurs without the specific warning signs\nmigraine aura without headache, also known as silent migraine – where an aura or other migraine symptoms are experienced, but a headache doesn't develop\n\nSome people have migraines frequently, up to several times a week. Other people only have a migraine occasionally. It's possible for years to pass between migraine attacks.\nRead more about the symptoms of migraine\nWhen to seek medical advice\nYou should see your GP if you have frequent or severe migraine symptoms.\nSimple painkillers such as paracetamol or ibuprofen can be effective for migraine. However, be careful not to take too many painkillers as this could make it harder to treat headaches over time.\nYou should also make an appointment to see your GP if you have frequent migraines (on more than five days a month), even if they can be controlled with medication, as you may benefit from preventative treatment.\nYou should call 999 for an ambulance immediately if you or someone you're with experiences:\n\nparalysis or weakness in one or both arms and/or one side of the face\nslurred or garbled speech\na sudden agonising headache resulting in a blinding pain unlike anything experienced before\nheadache along with a high temperature (fever), stiff neck, mental confusion, seizures, double vision and a rash\n\nThese symptoms may be a sign of a more serious condition, such as a stroke or meningitis, and should be assessed by a doctor as soon as possible.\nRead more about diagnosing migraines\nCauses of migraines\nThe exact cause of migraines is unknown, although they're thought to be the result of temporary changes in the chemicals, nerves and blood vessels in the brain.\nAround half of all people who experience migraines also have a close relative with the condition, suggesting that genes may play a role.\nSome people find migraine attacks are associated with certain triggers, which can include:\n\nstarting their period\nstress\ntiredness\ncertain foods or drinks\n\nRead more about the causes of migraines\nTreating migraines\nThere's no cure for migraines, but a number of treatments are available to help reduce the symptoms.\nThese include:\n\npainkillers – including over-the-counter medications such as paracetamol and ibuprofen\ntriptans – medications that can help reverse the changes in the brain that may cause migraines\nanti-emetics – medications often used to reduce nausea and vomiting\n\nDuring an attack, many people find that sleeping or lying in a darkened room can also help.\nRead more about treating migraines\nPreventing migraines\nIf you suspect a specific trigger is causing your migraines, such as stress or a certain type of food, avoiding this trigger may help reduce your risk of experiencing migraines.\nIt may also help to maintain a generally healthy lifestyle, including regular exercise, sleep and meals, as well as ensuring you stay well hydrated and limiting your intake of caffeine and alcohol.\nIf your migraines are severe or you've tried avoiding possible triggers and are still experiencing symptoms, your GP may prescribe medication to help prevent further attacks.\nMedications used to prevent migraines include the anti-seizure medication topiramate and a medication called propranolol that's usually used to treat high blood pressure. It may take several weeks before your migraine symptoms begin to improve.\nRead more about preventing migraines\nOutlook\nMigraines can severely affect your quality of life and stop you carrying out your normal daily activities. Some people find they need to stay in bed for days at a time.\nHowever, a number of effective treatments are available to reduce the symptoms and prevent further attacks.\nMigraine attacks can sometimes get worse over time, but they tend to gradually improve over many years for most people.\n"}, {"Name": "Mouth Ulcer", "Cure": "\nMouth ulcers are painful sores that appear in the mouth. Although they're uncomfortable, they’re usually harmless and most clear up by themselves within a week or two.\nMouth ulcers are common and can usually be managed at home, without seeing your dentist or GP.\nWhat does a mouth ulcer look like?\nMouth ulcers are usually round or oval sores that commonly appear inside the mouth on the:\n\ncheeks\nlips\ntongue\n\nThey can be white, red, yellow or grey in colour and swollen.\nIt's possible to have more than one mouth ulcer at a time and they may spread or grow.\nMouth ulcers shouldn't be confused with cold sores, which are small blisters that develop on the lips or around the mouth. Cold sores often begin with a tingling, itching or burning sensation around your mouth.\n"}, {"Name": "Neck Problems", "Cure": "\nNeck problems can cause a range of symptoms including pain (which may go down your arm), stiffness and pins and needles/numbness in your arm or hand.\nIn many cases, new or flare-up of long-standing neck problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nSpeak to a healthcare professional as soon as possible if:\n\nfeel numbness, pins and needles or weakness that is worsening in one or both arms\nhave problems with your balance or walking since your neck pain started\ndevelop blurred vision, ringing in your ears or dizziness that doesn't go away within 48 hours\n\nWhat causes neck problems?\nNeck problems are normally caused by an accident or normal age-related changes. They can also start for no obvious reason.\nNeck problems are rarely due to any serious disease or damage.\nCan this cause problems anywhere else?\nYour neck problem can sometimes cause hot, burning, shooting, or stabbing in your shoulders or into one or both of your arms. This can be due to nerve pain.\nNeck pain can also cause headaches.\nSelf-help\nKeeping active is an essential part of your treatment and recovery and is the single best thing you can do for your health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you have less discomfort and good movement. Remember to warm up before sports.\nExercises to help with neck problems\nResting or moving?\nAfter a neck problem you should:\n\nkeep moving, even if you move slowly at first\nmove your neck for short periods every hour\nchange positions regularly where ever you are - try to find a position that reduces any pains you may have in your neck and/or arm(s)\ntry to stay active but remember not to carry out activities which aggravate any pains you may have in your neck and/or arm(s)\ncheck your pillow isn't too firm or your mattress too soft - this can make your neck problem worse\ndo whatever you normally would and stay at, or return to work - this is important and the best way to get better\n\nUse of a collar isn't recommended.\nPain treatments\nThe following can help to reduce the pain:\n\nPain medication - this can help you move more comfortably, which can help your recovery\nHeat packs\n\nSpeak to your community pharmacist or other healthcare professional about taking medication. It's important to take medication regularly.\nMore about taking painkillers\nWork\nIt's recommended you stay at or return to work as quickly as possible during your recovery. You don't need to be pain or symptom-free to return to work.\nHelp and support\nIf, after following the above advice, your neck problem hasn't improved within 2 weeks a referral to a physiotherapist may be of benefit.\nIf available in your health board area, the Musculoskeletal (MSK) Helpline can refer you to a healthcare professional if you need it.\n"}, {"Name": "Nosebleed", "Cure": "\nNosebleeds can be frightening, but they aren't usually a sign of anything serious and can often be treated at home.\nThe medical name for a nosebleed is epistaxis.\nDuring a nosebleed, blood flows from one or both nostrils. It can be heavy or light and last from a few seconds to 15 minutes or more.\nWhat to do\nTo stop a nosebleed:\n\nsit down and firmly pinch the soft part of your nose, just above your nostrils, for at least 10-15 minutes\nlean forward and breathe through your mouth – this will drain blood into your nose instead of down the back of your throat\nplace an ice pack or bag of frozen vegetables covered by a towel on the bridge of your nose\nstay upright, rather than lying down, as this reduces the blood pressure in the blood vessels of your nose and will discourage further bleeding\n\nIf the bleeding eventually stops, you won't usually need to seek medical advice. However, in some cases you may need further treatment from your GP or in hospital (see below).\nRead more about treating nosebleeds\nWhen to seek medical advice\nContact your GP or call NHS 24's 111 service if:\n\nyou're taking a blood-thinning medicine (anticoagulant) such as warfarin or have a clotting disorder such as haemophilia and the bleeding doesn't stop\nyou have symptoms of anaemia such as heart palpitations, shortness of breath and a pale complexion\na child under two years of age has a nosebleed\nyou have nosebleeds that come and go regularly\n\nAsk someone to drive you to your nearest accident and emergency (A&E) department or call 999 for an ambulance if:\n\nthe bleeding continues for longer than 20 minutes\nthe bleeding is heavy and you've lost a lot of blood\nyou're having difficulty breathing\nyou swallow a large amount of blood that makes you vomit\nthe nosebleed developed after a serious injury, such as a car crash\n\nWhat causes nosebleeds?\nThe inside of your nose is full of tiny, delicate blood vessels that can become damaged and bleed relatively easily.\nCommon causes of nosebleeds include:\n\npicking your nose\nblowing your nose very hard\na minor injury to your nose\nchanges in humidity or temperature causing the inside of the nose to become dry and cracked\n\nOccasionally, bleeding can come from the blood vessels deeper within the nose. This can be caused by a blow to the head, recent nasal surgery and hardened arteries (atherosclerosis).\nRead more about the causes of nosebleeds\nWho gets nosebleeds?\nNosebleeds are fairly common and most people will experience them every now and again. Anyone can get a nosebleed, but they most often affect:\n\nchildren between two and 10 years of age\nelderly people\npregnant women\npeople who take blood thinning medication such as aspirin or anticoagulants, such as warfarin\npeople with blood clotting disorders, such as haemophilia\n\nBleeding may also be heavier or last longer if you take anticoagulants, have a blood clotting disorder, or have high blood pressure (hypertension).\nAre nosebleeds serious?\nNosebleeds aren't usually serious. However, frequent or heavy nosebleeds may indicate more serious health problems, such as high blood pressure or a blood clotting disorder, and should be checked.\nExcessive bleeding over a prolonged period of time can also lead to further problems such as anaemia.\nIf your GP suspects a more serious problem is causing your nosebleeds, they may refer you to an ear, nose and throat (ENT) specialist for further tests.\nPreventing nosebleeds\nThings you can do to prevent nosebleeds include:\n\navoid picking your nose and keep your fingernails short\nblow your nose as little as possible and only very gently\nkeep your home humidified\nwear a head guard during activities in which your nose or head could get injured\nalways follow the instructions that come with nasal decongestants – overusing these can cause nosebleeds\n\nTalk to your GP if you experience nosebleeds frequently and aren't able to prevent them. They may refer you to an ENT specialist for an assessment.\n"}, {"Name": "Skin Rashes In Children", "Cure": "\nChildhood rashes are common and aren't usually a cause for concern. Most rashes are harmless and disappear without the need for treatment.\nHowever, see your GP if your child has a rash and seems unwell, or if you're worried. They'll be able to investigate the cause and recommend any necessary treatment.\nThis page may give you a better idea about what could be causing the rash, but don't use this to self-diagnose your child's condition – always see a GP for a proper diagnosis.\nThe most common causes of rashes in children are:\n\ncellulitis\nchickenpox \neczema\nerythema multiforme \nhand, foot and mouth disease  \nimpetigo\nkeratosis pilaris (\"chicken skin\")\nmeasles\nmolluscum contagiosum\npityriasis rosea\nprickly heat\npsoriasis\nringworm \nscabies\nscarlet fever \nslapped cheek syndrome\nurticaria (hives) \n\nThe skin rash of meningitis is also covered on the page. Although meningitis has become less common over recent years, it's important to be aware of the rash and the other signs and symptoms of meningitis.\nCellulitis\nCellulitis is an infection of the deeper layers of skin and underlying tissue. The affected area will be red, painful, swollen and hot. It often affects the legs, but can occur anywhere on the body. Your child will probably also have a fever.\nSee your GP immediately if an area of your child's skin suddenly turns red, hot and tender. If you can't see your GP on the same day, go to a walk-in centre or minor injuries unit.\nCellulitis can usually be diagnosed by assessing the symptoms and examining the skin. It usually responds well to treatment with antibiotics.\nChickenpox\nChickenpox is a viral illness that most children catch at some point. It most commonly affects children under 10 years of age.\nA rash of itchy spots turns into fluid-filled blisters. They crust over to form scabs, which after a while drop off. Some children only have a few spots, whereas others have them over their entire body. The spots are most likely to appear on the face, ears and scalp, under the arms, on the chest and belly, and on the arms and legs.\nThere's no specific treatment for chickenpox, but you can take steps to relieve the symptoms. For example, paracetamol can help relieve fever (don't give aspirin to children under 16), and calamine lotion and cooling gels can be used to ease itching.\nRead more about treating chickenpox.\nEczema\nEczema is a long-term condition that causes the skin to become itchy, red, dry and cracked. The most common type is atopic eczema, which mainly affects children but can continue into adulthood.\nAtopic eczema commonly develops behind the knees or on the elbows, neck, eyes and ears. It isn't a serious condition, but if your child later becomes infected with the herpes simplex virus, it can cause the eczema to flare up into an outbreak of tiny blisters called eczema herpeticum, and will cause a fever.\nAbout one in five children in the UK has eczema, and in eight out 10 cases it develops before the age of five, often before a child's first birthday. \nRead about treating atopic eczema.\nErythema multiforme\nErythema multiforme is a skin rash (usually mild) that's caused by an allergic reaction to the herpes simplex virus.\nThe spots look like targets, with a dark red centre and paler ring around the outside. The hands or feet tend to be affected first, followed by the limbs, upper body and face.\nYour child will probably feel unwell and may have a fever, which you should be able to treat with over-the-counter medicine. It may take from two to six weeks before they feel better. See your GP if your child has a rash and seems unwell.\nIn rare cases, erythema multiforme can be triggered by a reaction to certain medications, such as an antibiotic or anticonvulsant. This more severe form is called Stevens-Johnson syndrome and it can be life-threatening.\nHand, foot and mouth disease\nHand, foot and mouth disease is a common, contagious infection that causes mouth ulcers and spots and blisters on the palms of the hands and soles of the feet.\nIt's most common in young children (particularly those under 10), but it can also affect older children and adults.\nThere's no cure for hand, foot and mouth disease and it's easily spread, so you should keep your child away from school or nursery until they're better. Your child's immune system will fight the virus and it should clear up after about seven to 10 days.\nMake sure your child drinks plenty of fluid, and if eating and swallowing is uncomfortable, give them soft foods, such as mashed potatoes, yoghurt and soup.\nImpetigo\nImpetigo is a common and highly contagious skin infection that causes sores and blisters. It isn't usually serious and often improves within a week of treatment. There are two types of impetigo – bullous and non-bullous.\nBullous impetigo typically affects the trunk (the area of the body between the waist and neck), and causes fluid-filled blisters that burst after a few days to leave a yellow crust.\nNon-bullous impetigo typically affects the skin around the nose and mouth, causing sores that quickly burst to leave a yellow-brown crust.\nSee your GP if you think your child has impetigo. Antibiotics, in the form of a cream or tablets, will be prescribed. This should reduce the length of the illness to around seven to 10 days.\nKeratosis pilaris (\"chicken skin\")\nKeratosis pilaris is a common and harmless skin condition. The skin on the back of the upper arms becomes rough and bumpy, as if covered in permanent goose pimples. Sometimes, the buttocks, thighs, forearms and upper back can also be affected.\nKeratosis pilaris typically begins in childhood and gets worse during puberty. Some people find it improves after this and may even disappear in adulthood.\nThere's no cure for keratosis pilaris, and it often gets better on its own without treatment. However, there are some measures you can take that may improve your child's rash, such as using non-soap cleansers rather than soap, and an emollient to moisturise their skin. Your GP or pharmacist will be able to recommend a suitable cream.\nMeasles\nMeasles is a highly infectious illness that most commonly affects young children. It's now rare in the UK because of the effectiveness of the measles, mumps and rubella (MMR) vaccine.\nThe measles rash is red-brown blotches. It usually starts on the head or upper neck and then spreads outwards to the rest of the body. Your child may also have a fever and cold-like symptoms.\nCall your GP surgery immediately if you think your child has measles. It's best to phone before visiting because the surgery may need to make arrangements to reduce the risk of spreading the infection to others.\nMeasles usually passes in about seven to 10 days without causing further problems. Paracetamol or ibuprofen can be used to relieve fever, aches and pains (don't give aspirin to children under 16). Also, make sure your child drinks plenty of water to avoid dehydration.\nRead more about treating measles.\nMolluscum contagiosum\nMolluscum contagiosum is a viral skin infection that causes clusters of small, firm, raised spots to develop on the skin.\nIt commonly affects young children aged one to five years, who tend to catch it after close physical contact with another infected child.\nThe condition is usually painless, although some children may experience some itchiness. It usually goes away within 18 months without the need for treatment.\nMolluscum contagiosum is highly infectious. However, most adults are resistant to the virus, which means they're unlikely to catch it if they come into contact with it.\nPityriasis rosea\nPityriasis rosea is a relatively common skin condition that causes a temporary rash of raised, red scaly patches to develop on the body. Most cases occur in older children and young adults (aged between 10 and 35).\nThe rash can be very itchy. In most cases, it clears up without treatment in 2 to 12 weeks, although in rare cases it can last up to five months.\nEmollients, steroid creams and antihistamines can be used to help relieve the itchiness. The rash doesn't usually leave scars, although the skin can sometimes be discoloured afterwards.\nPrickly heat (heat rash)\nPrickly heat (heat rash), also known as miliaria, is an itchy rash of small, raised red spots that causes a stinging or prickly sensation on the skin.\nIt occurs when the sweat ducts in the outer layer of skin (epidermis) are obstructed. You can get a heat rash anywhere on your body, but the face, neck, back, chest or thighs are most often affected.\nInfants can sometimes get a prickly heat rash if they sweat more than usual – for example, when it's hot and humid or if they're overdressed. It isn't a serious condition and rarely requires any specific treatment.\nPsoriasis\nPsoriasis is a long-lasting (chronic) skin condition that causes red, flaky, crusty patches of skin covered with silvery scales.\nThe severity of psoriasis varies greatly from person to person. For some people, it's just a minor irritation, but for others it can have a major impact on their quality of life. \nThere's no cure for psoriasis, but there are a number of treatments that can help improve the symptoms and appearance of skin patches. For example, topical corticosteroids are creams and ointments that can be applied to the skin.\nRingworm\nRingworm is a highly infectious fungal skin infection that causes a ring-like red or silvery patch on the skin that can be scaly, inflamed or itchy.\nRingworm often affects the arms and legs, but it can appear almost anywhere on the body. Other similar fungal infections can affect the scalp, feet, groin and nails.\nRingworm can usually be easily treated with antifungal medicines, which are available from a pharmacy. Ringworm of the scalp can cause scaling and patches of hair loss. It's treated with antifungal tablets, often combined with antifungal shampoo.\nScabies\nScabies is a contagious skin condition that's intensely itchy. It's caused by tiny mites that burrow into the skin.\nIn children, scabies is usually spread through prolonged periods of skin-to-skin contact with an infected adult or child – for example, during play fighting or hugging.\nThe mites like warm places, such as skin folds, between the fingers, under fingernails, or around the buttock creases. They leave small red blotches, which are often found on the palms of the hands or soles of the feet. In infants, blisters are commonly found on the soles of the feet. \nSee your GP if you think your child has scabies. It's not usually a serious condition, but it does need to be treated. Your GP will prescribe a lotion or cream. Read more about treating scabies.\nScarlet fever\nScarlet fever is a highly contagious bacterial infection that usually affects children between two and eight years of age. It causes a distinctive pink-red rash, which feels like sandpaper to touch and may be itchy.\nIt often starts with a sore throat, fever and headache, with the rash developing two to five days after infection. The rash usually occurs on the chest and stomach before spreading to other areas of the body, such as the ears and neck.\nScarlet fever usually clears up after about a week, but see your GP if you think your child may have it. Antibiotics are used to treat it (liquid antibiotics, such as penicillin or amoxicillin, are often used to treat children).\nSlapped cheek syndrome\nSlapped cheek syndrome – also known as fifth disease or parvovirus B19 – is a viral infection that's common in children aged six to 10.\nIt causes a distinctive bright red rash to develop on both cheeks. This can look alarming, but it usually clears up by itself in one to three weeks.\nUnless your child is feeling unwell, they don't need to stay away from school. Once the rash appears, the infection is no longer contagious. However, it's a good idea to notify your child's school about the infection.\nUrticaria (hives)\nUrticaria – also known as hives, weals, welts or nettle rash – is a raised, itchy rash that can affect one part of the body or be spread across large areas. It's a common skin reaction that often affects children.\nUrticaria occurs when a trigger causes high levels of histamine and other chemical messengers to be released in the skin. These substances cause the blood vessels in the skin to open up, resulting in redness or pinkness, and swelling and itchiness.\nThere are many possible triggers of urticaria, including allergens, such as food or latex, irritants, such as nettles, medicines, and physical factors, such as heat or exercise. Sometimes, a cause can't be identified.\nThe rash is usually short-lived and mild, and can often be controlled with antihistamines.\n"}, {"Name": "Shortness Of Breath", "Cure": "\nSudden shortness of breath, or breathing difficulty (dyspnoea), is the most common reason for visiting a hospital accident and emergency department.\nIt's also one of the most common reasons people call 999 for an ambulance.\nIt's normal to get out of breath when you've overexerted yourself, but when breathlessness comes on suddenly and unexpectedly, it's usually a warning sign of a medical condition.\nThe information below outlines the most common reasons for:\n\nsudden shortness of breath\nlong-term shortness of breath\n\nThis guide shouldn't be used to self-diagnose your condition, but should give you an idea of what's causing your breathlessness.\nWhen to call a doctor\nYou should call your GP immediately if you have sudden unexpected shortness of breath, as there may be a problem with your airways or heart.\nYour GP will assess you over the phone, and may either visit you at home or admit you to hospital. If your shortness of breath is mild or the result of anxiety, you may be asked to come to the surgery rather than a home visit.\nIf you've struggled with your breathing for a while, don't ignore it. See your GP as it's likely you have a long-term condition, such as obesity, asthma or chronic obstructive pulmonary disease (COPD), which needs to be managed properly.\nYour doctor may ask you some questions, such as:\n\nDid the breathlessness come on suddenly or gradually?\nDid anything trigger it, such as exercise?\nHow bad is it? Does it only happen when you've been active, or when you're not doing anything?\nIs there any pain when you breathe?\nDo you have a cough?\nDo certain positions make it worse – for example, are you unable to lie down?\n\nFeeling like you can't get enough air can be terrifying, but doctors are well trained in managing this. You may be given extra oxygen to breathe if this is needed.\nCauses of sudden shortness of breath\nSudden and unexpected breathlessness is most likely to be caused by one of the following health conditions. Click on the references at the end for more information about these conditions.\nA problem with your lungs or airways\nSudden breathlessness could be an asthma attack. This means your airways have narrowed and you'll produce more phlegm (sticky mucus), which causes you to wheeze and cough. You'll feel breathless because it's difficult to move air in and out of your airways.\nYour GP may advise you to use a spacer device with your asthma inhaler. This delivers more medicine to your lungs, helping to relieve your breathlessness.\nPneumonia (lung inflammation) may also cause shortness of breath and a cough. It's usually caused by an infection, so you'll need to take antibiotics.\nIf you have COPD, it's likely your breathlessness is a sign this condition has suddenly got worse.\nA heart problem\nIt's possible to have a \"silent\" heart attack without experiencing all the obvious symptoms, such as chest pain and overwhelming anxiety.\nIn this case, shortness of breath may be the only warning sign you're having a heart attack. If you or your GP think this is the case, they'll give you aspirin and admit you to hospital straight away.\nHeart failure can also cause breathing difficulties. This life-threatening condition means your heart is having trouble pumping enough blood around your body, usually because the heart muscle has become too weak or stiff to work properly. It leads to a build-up of fluid inside the lungs, which makes breathing more difficult.\nA combination of lifestyle changes and medicines or surgery will help the heart pump better and relieve your breathlessness.\nBreathlessness could also relate to a problem with your heart rate or rhythm, such as atrial fibrillation (an irregular and fast heart rate) or supraventricular tachycardia (regular and fast heart rate).\nPanic attack or anxiety\nA panic attack or anxiety can cause you to take rapid or deep breaths, known as hyperventilating. Concentrating on slow breathing or breathing through a paper bag can bring your breathing back to normal but should only be done when you are certain anxiety is the cause of your breathlessness.\nMore unusual causes\nThese include:\n\na severe allergic reaction (anaphylaxis)\npneumothorax – partial collapse of your lung caused by a small tear in the lung surface, which allows air to become trapped in the space around your lungs\npulmonary embolism – a blockage in one of the blood vessels in the lung\nidiopathic pulmonary fibrosis – a rare and poorly understood lung condition that causes scarring of the lungs\npleural effusion – a collection of fluid next to the lung\ndiabetic ketoacidosis – a complication of diabetes where acids build up in your blood and urine\n\nCauses of long-term breathlessness\nLong-term breathlessness is usually caused by:\n\nobesity or being unfit\npoorly controlled asthma\nchronic obstructive pulmonary disease (COPD) – permanent damage to the lungs usually caused by years of smoking\nanaemia – a low level of oxygen in the blood caused by a lack of red blood cells or haemoglobin (the part of red blood cells that carries oxygen)\nheart failure – when your heart is having trouble pumping enough blood around your body, usually because the heart muscle has become too weak or stiff to work properly\na problem with your heart rate or rhythm, such as atrial fibrillation (an irregular and fast heart rate) or supraventricular tachycardia (regular and fast heart rate)\n\nMore unusual causes of long-term breathlessness are:\n\nbronchiectasis – a lung condition where the airways are abnormally widened and you have a persistent phlegmy cough\npulmonary embolism – a recurrent blockage in a blood vessel in the lung\npartial collapse of your lung caused by lung cancer\npleural effusion – a collection of fluid next to the lung\nnarrowing of the main heart valve, restricting blood flow to the rest of the body\nfrequent panic attacks, which can cause you to hyperventilate (take rapid or deep breaths)\n\n"}, {"Name": "Shoulder Problems", "Cure": "\nShoulder problems can cause a range of symptoms including pain, stiffness and weakness.\nIn many cases, new or flare-up of long-standing shoulder problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nSpeak to a healthcare professional as soon as possible if there's been significant trauma, for example a fall from height or direct blow to the shoulder, and your pain is preventing any shoulder movement at all.\nWhat causes shoulder problems?\nShoulder problems are common and are often caused by simple things like:\n\ntaking off your coat\nlifting something awkwardly\ntaking part in sport\na trip or fall\n\nAs you get older, normal age-related changes can cause your shoulder problem to flare-up now and again, often for no reason.\nCan this cause problems anywhere else?\nYou may feel pains around your shoulder and neck, and into your arm.\nSelf-help\nKeeping active is an essential part of your treatment and recovery and is the single best thing you can do for your health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you have less discomfort and good movement. Remember to warm up fully before you start sporting activities.\nExercises to help with shoulder problems\n"}, {"Name": "Skin Rashes In Children", "Cure": "\nChildhood rashes are common and aren't usually a cause for concern. Most rashes are harmless and disappear without the need for treatment.\nHowever, see your GP if your child has a rash and seems unwell, or if you're worried. They'll be able to investigate the cause and recommend any necessary treatment.\nThis page may give you a better idea about what could be causing the rash, but don't use this to self-diagnose your child's condition – always see a GP for a proper diagnosis.\nThe most common causes of rashes in children are:\n\ncellulitis\nchickenpox \neczema\nerythema multiforme \nhand, foot and mouth disease  \nimpetigo\nkeratosis pilaris (\"chicken skin\")\nmeasles\nmolluscum contagiosum\npityriasis rosea\nprickly heat\npsoriasis\nringworm \nscabies\nscarlet fever \nslapped cheek syndrome\nurticaria (hives) \n\nThe skin rash of meningitis is also covered on the page. Although meningitis has become less common over recent years, it's important to be aware of the rash and the other signs and symptoms of meningitis.\nCellulitis\nCellulitis is an infection of the deeper layers of skin and underlying tissue. The affected area will be red, painful, swollen and hot. It often affects the legs, but can occur anywhere on the body. Your child will probably also have a fever.\nSee your GP immediately if an area of your child's skin suddenly turns red, hot and tender. If you can't see your GP on the same day, go to a walk-in centre or minor injuries unit.\nCellulitis can usually be diagnosed by assessing the symptoms and examining the skin. It usually responds well to treatment with antibiotics.\nChickenpox\nChickenpox is a viral illness that most children catch at some point. It most commonly affects children under 10 years of age.\nA rash of itchy spots turns into fluid-filled blisters. They crust over to form scabs, which after a while drop off. Some children only have a few spots, whereas others have them over their entire body. The spots are most likely to appear on the face, ears and scalp, under the arms, on the chest and belly, and on the arms and legs.\nThere's no specific treatment for chickenpox, but you can take steps to relieve the symptoms. For example, paracetamol can help relieve fever (don't give aspirin to children under 16), and calamine lotion and cooling gels can be used to ease itching.\nRead more about treating chickenpox.\nEczema\nEczema is a long-term condition that causes the skin to become itchy, red, dry and cracked. The most common type is atopic eczema, which mainly affects children but can continue into adulthood.\nAtopic eczema commonly develops behind the knees or on the elbows, neck, eyes and ears. It isn't a serious condition, but if your child later becomes infected with the herpes simplex virus, it can cause the eczema to flare up into an outbreak of tiny blisters called eczema herpeticum, and will cause a fever.\nAbout one in five children in the UK has eczema, and in eight out 10 cases it develops before the age of five, often before a child's first birthday. \nRead about treating atopic eczema.\nErythema multiforme\nErythema multiforme is a skin rash (usually mild) that's caused by an allergic reaction to the herpes simplex virus.\nThe spots look like targets, with a dark red centre and paler ring around the outside. The hands or feet tend to be affected first, followed by the limbs, upper body and face.\nYour child will probably feel unwell and may have a fever, which you should be able to treat with over-the-counter medicine. It may take from two to six weeks before they feel better. See your GP if your child has a rash and seems unwell.\nIn rare cases, erythema multiforme can be triggered by a reaction to certain medications, such as an antibiotic or anticonvulsant. This more severe form is called Stevens-Johnson syndrome and it can be life-threatening.\nHand, foot and mouth disease\nHand, foot and mouth disease is a common, contagious infection that causes mouth ulcers and spots and blisters on the palms of the hands and soles of the feet.\nIt's most common in young children (particularly those under 10), but it can also affect older children and adults.\nThere's no cure for hand, foot and mouth disease and it's easily spread, so you should keep your child away from school or nursery until they're better. Your child's immune system will fight the virus and it should clear up after about seven to 10 days.\nMake sure your child drinks plenty of fluid, and if eating and swallowing is uncomfortable, give them soft foods, such as mashed potatoes, yoghurt and soup.\nImpetigo\nImpetigo is a common and highly contagious skin infection that causes sores and blisters. It isn't usually serious and often improves within a week of treatment. There are two types of impetigo – bullous and non-bullous.\nBullous impetigo typically affects the trunk (the area of the body between the waist and neck), and causes fluid-filled blisters that burst after a few days to leave a yellow crust.\nNon-bullous impetigo typically affects the skin around the nose and mouth, causing sores that quickly burst to leave a yellow-brown crust.\nSee your GP if you think your child has impetigo. Antibiotics, in the form of a cream or tablets, will be prescribed. This should reduce the length of the illness to around seven to 10 days.\nKeratosis pilaris (\"chicken skin\")\nKeratosis pilaris is a common and harmless skin condition. The skin on the back of the upper arms becomes rough and bumpy, as if covered in permanent goose pimples. Sometimes, the buttocks, thighs, forearms and upper back can also be affected.\nKeratosis pilaris typically begins in childhood and gets worse during puberty. Some people find it improves after this and may even disappear in adulthood.\nThere's no cure for keratosis pilaris, and it often gets better on its own without treatment. However, there are some measures you can take that may improve your child's rash, such as using non-soap cleansers rather than soap, and an emollient to moisturise their skin. Your GP or pharmacist will be able to recommend a suitable cream.\nMeasles\nMeasles is a highly infectious illness that most commonly affects young children. It's now rare in the UK because of the effectiveness of the measles, mumps and rubella (MMR) vaccine.\nThe measles rash is red-brown blotches. It usually starts on the head or upper neck and then spreads outwards to the rest of the body. Your child may also have a fever and cold-like symptoms.\nCall your GP surgery immediately if you think your child has measles. It's best to phone before visiting because the surgery may need to make arrangements to reduce the risk of spreading the infection to others.\nMeasles usually passes in about seven to 10 days without causing further problems. Paracetamol or ibuprofen can be used to relieve fever, aches and pains (don't give aspirin to children under 16). Also, make sure your child drinks plenty of water to avoid dehydration.\nRead more about treating measles.\nMolluscum contagiosum\nMolluscum contagiosum is a viral skin infection that causes clusters of small, firm, raised spots to develop on the skin.\nIt commonly affects young children aged one to five years, who tend to catch it after close physical contact with another infected child.\nThe condition is usually painless, although some children may experience some itchiness. It usually goes away within 18 months without the need for treatment.\nMolluscum contagiosum is highly infectious. However, most adults are resistant to the virus, which means they're unlikely to catch it if they come into contact with it.\nPityriasis rosea\nPityriasis rosea is a relatively common skin condition that causes a temporary rash of raised, red scaly patches to develop on the body. Most cases occur in older children and young adults (aged between 10 and 35).\nThe rash can be very itchy. In most cases, it clears up without treatment in 2 to 12 weeks, although in rare cases it can last up to five months.\nEmollients, steroid creams and antihistamines can be used to help relieve the itchiness. The rash doesn't usually leave scars, although the skin can sometimes be discoloured afterwards.\nPrickly heat (heat rash)\nPrickly heat (heat rash), also known as miliaria, is an itchy rash of small, raised red spots that causes a stinging or prickly sensation on the skin.\nIt occurs when the sweat ducts in the outer layer of skin (epidermis) are obstructed. You can get a heat rash anywhere on your body, but the face, neck, back, chest or thighs are most often affected.\nInfants can sometimes get a prickly heat rash if they sweat more than usual – for example, when it's hot and humid or if they're overdressed. It isn't a serious condition and rarely requires any specific treatment.\nPsoriasis\nPsoriasis is a long-lasting (chronic) skin condition that causes red, flaky, crusty patches of skin covered with silvery scales.\nThe severity of psoriasis varies greatly from person to person. For some people, it's just a minor irritation, but for others it can have a major impact on their quality of life. \nThere's no cure for psoriasis, but there are a number of treatments that can help improve the symptoms and appearance of skin patches. For example, topical corticosteroids are creams and ointments that can be applied to the skin.\nRingworm\nRingworm is a highly infectious fungal skin infection that causes a ring-like red or silvery patch on the skin that can be scaly, inflamed or itchy.\nRingworm often affects the arms and legs, but it can appear almost anywhere on the body. Other similar fungal infections can affect the scalp, feet, groin and nails.\nRingworm can usually be easily treated with antifungal medicines, which are available from a pharmacy. Ringworm of the scalp can cause scaling and patches of hair loss. It's treated with antifungal tablets, often combined with antifungal shampoo.\nScabies\nScabies is a contagious skin condition that's intensely itchy. It's caused by tiny mites that burrow into the skin.\nIn children, scabies is usually spread through prolonged periods of skin-to-skin contact with an infected adult or child – for example, during play fighting or hugging.\nThe mites like warm places, such as skin folds, between the fingers, under fingernails, or around the buttock creases. They leave small red blotches, which are often found on the palms of the hands or soles of the feet. In infants, blisters are commonly found on the soles of the feet. \nSee your GP if you think your child has scabies. It's not usually a serious condition, but it does need to be treated. Your GP will prescribe a lotion or cream. Read more about treating scabies.\nScarlet fever\nScarlet fever is a highly contagious bacterial infection that usually affects children between two and eight years of age. It causes a distinctive pink-red rash, which feels like sandpaper to touch and may be itchy.\nIt often starts with a sore throat, fever and headache, with the rash developing two to five days after infection. The rash usually occurs on the chest and stomach before spreading to other areas of the body, such as the ears and neck.\nScarlet fever usually clears up after about a week, but see your GP if you think your child may have it. Antibiotics are used to treat it (liquid antibiotics, such as penicillin or amoxicillin, are often used to treat children).\nSlapped cheek syndrome\nSlapped cheek syndrome – also known as fifth disease or parvovirus B19 – is a viral infection that's common in children aged six to 10.\nIt causes a distinctive bright red rash to develop on both cheeks. This can look alarming, but it usually clears up by itself in one to three weeks.\nUnless your child is feeling unwell, they don't need to stay away from school. Once the rash appears, the infection is no longer contagious. However, it's a good idea to notify your child's school about the infection.\nUrticaria (hives)\nUrticaria – also known as hives, weals, welts or nettle rash – is a raised, itchy rash that can affect one part of the body or be spread across large areas. It's a common skin reaction that often affects children.\nUrticaria occurs when a trigger causes high levels of histamine and other chemical messengers to be released in the skin. These substances cause the blood vessels in the skin to open up, resulting in redness or pinkness, and swelling and itchiness.\nThere are many possible triggers of urticaria, including allergens, such as food or latex, irritants, such as nettles, medicines, and physical factors, such as heat or exercise. Sometimes, a cause can't be identified.\nThe rash is usually short-lived and mild, and can often be controlled with antihistamines.\n"}, {"Name": "Sore Throat", "Cure": "\nSore throats are very common and usually nothing to worry about. They normally get better within a week.\nMost are caused by minor illnesses such as colds or flu and can be treated at home.\nTreatments for a sore throat\nThe following measures can often help soothe a sore throat:\n\ntake ibuprofen or paracetamol – paracetamol is better for children and for people who can't take ibuprofen (note that children under 16 should never take aspirin)\ndrink plenty of cool or warm fluids, and avoid very hot drinks\neat cool, soft foods\navoid smoking and smoky places\ngargle with a homemade mouthwash of warm, salty water\nsuck lozenges, hard sweets, ice cubes or ice lollies – but don't give young children anything small and hard to suck because of the risk of choking\n\nThere are also products such as medicated lozenges and sprays sold in pharmacies that you may want to try. There isn't much scientific evidence to suggest they help, although some people find them worth using.\nAntibiotics aren't usually prescribed for a sore throat, even if it's caused by a bacterial infection, as they're unlikely to make you feel better any quicker and they can have unpleasant side effects.\n"}, {"Name": "Stomach Ache And Abdominal Pain", "Cure": "\nA stomach ache is a term often used to refer to cramps or a dull ache in the tummy (abdomen). It's usually short-lived and is often not serious.\nSevere abdominal pain is a greater cause for concern. If it starts suddenly and unexpectedly, it should be regarded as a medical emergency, especially if the pain is concentrated in a particular area.\nIf this is the case phone your GP as soon as possible, or the 111 service if your GP is closed.\nIf you feel pain in the area around your ribs, read about chest pain for information and advice.\nStomach cramps with bloating\nStomach cramps with bloating are often caused by trapped wind. This is a very common problem that can be embarrassing but is easily dealt with.\nYour pharmacist will be able to recommend a product such as buscopan or mebeverine, which can be bought over the counter to treat the problem.\nSudden stomach cramps with diarrhoea\nIf your stomach cramps have started recently and you also have diarrhoea, the cause may be a tummy bug (gastroenteritis). This means you have a viral or bacterial infection of the stomach and bowel, which should get better without treatment after a few days.\nGastroenteritis may be caused by coming into close contact with someone who's infected, or by eating contaminated food (food poisoning).\nIf you have repeated bouts of stomach cramps and diarrhoea, you may have a long-term condition, such as irritable bowel syndrome (IBS).\nSudden severe abdominal pain\nIf you have sudden agonising pain in a particular area of your abdomen, phone your GP immediately or the 111 service if your GP is closed. It may be a sign of a serious problem that could rapidly get worse without treatment.\nSerious causes of sudden severe abdominal pain include:\n\nappendicitis – the swelling of the appendix (a finger-like pouch connected to the large intestine), which causes agonising pain in the lower right-hand side of your abdomen, and means your appendix will need to be removed\na bleeding or perforated stomach ulcer – a bleeding, open sore in the lining of your stomach or duodenum (the first part of the small intestine)\nacute cholecystitis – inflammation of the gallbladder, which is often caused by gallstones, in many cases, your gallbladder will need to be removed\nkidney stones – small stones may be passed out in your urine, but larger stones may block the kidney tubes, and you'll need to go to hospital to have them broken up\ndiverticulitis – inflammation of the small pouches in the bowel that sometimes requires treatment with antibiotics in hospital\n\nIf your GP suspects you have one of these conditions, they may refer you to hospital immediately.\nSudden and severe pain in your abdomen can also sometimes be caused by an infection of the stomach and bowel (gastroenteritis). It may also be caused by a pulled muscle in your abdomen or by an injury.\nLong-term or recurring abdominal pain\nSee your GP if you or your child have persistent or repeated abdominal pain. The cause is often not serious and can be managed.\nPossible causes in adults include:\n\nIBS – a common condition that causes bouts of stomach cramps, bloating, diarrhoea or constipation, the pain is often relieved when you go to the toilet\ninflammatory bowel disease (IBD) – long-term conditions that involve inflammation of the gut, including Crohn's disease, ulcerative colitis and endometriosis \na urinary tract infection (UTI) that keeps returning – in these cases, you'll usually also experience a burning sensation when you urinate\nconstipation \nperiod pain – painful muscle cramps in women that are linked to the menstrual cycle\nother stomach-related problems – such as a stomach ulcer, heartburn and acid reflux or gastritis (inflammation of the stomach lining)\n\nPossible causes in children include:\n\nconstipation\na UTI that keeps returning\nheartburn and acid reflux\nabdominal migraines – recurrent episodes of abdominal pain with no identifiable cause\n\n"}, {"Name": "Swollen Glands", "Cure": "\n\nSwollen lymph glands are usually a sign of infection and tend to go down when you recover. However, they can sometimes have a more serious cause and may need to be seen by a doctor.\nLymph glands (also called lymph nodes) are pea-sized lumps of tissue that contain white blood cells. These help to fight bacteria, viruses and anything else that causes infection. They are an important part of the immune system and are found throughout the body.\nThe glands can swell to more than a few centimetres in response to infection or disease. Swollen glands, known medically as lymphadenopathy, may be felt under the chin or in the neck, armpits or groin, where they can be found in larger clumps.\nMany different types of infection can cause swollen glands, such as a cold or glandular fever. Less commonly, swollen glands may be caused by a non-infectious condition, such as rheumatoid arthritis or even cancer.\nWhen to see your GP\nSee your GP if you have swollen glands and:\n\nthey haven't gone down within a few weeks or are getting bigger\nthey feel hard or don’t move when you press them\nyou also have a sore throat and find it difficult to swallow or breathe\nyou also have unexplained weight loss, night sweats or a persistent high temperature (fever)\nyou don't have an obvious infection and don't feel unwell\n\nIf necessary, your GP may request some tests to help identify the cause. These can include blood tests, an ultrasound scan or computerised tomography (CT) scan, and/or a biopsy (where a small sample of fluid is taken from the swelling and tested).\nCommon causes of swollen glands\nSwollen glands are usually caused by a relatively minor viral or bacterial infection, including:\n\na cold\ntonsillitis\nglandular fever\na throat infection\nan ear infection\na dental abscess\ncellulitis (a skin infection)\n\nThe glands in the affected area will often become suddenly tender or painful. You may also have additional symptoms, such as a sore throat, cough, or fever.\nThese infections usually clear up on their own, and the swollen glands will soon go down. You will normally just need to drink plenty of fluids, rest and relieve the symptoms at home using over-the-counter medicines such as paracetamol or ibuprofen.\nSee your GP if your symptoms don't improve within a few weeks.\nLess common causes of swollen glands\nLess often, swollen glands may be the result of:\n\nrubella – a viral infection that causes a red-pink skin rash made up of small spots\nmeasles – a highly infectious viral illness that causes distinctive red or brown spots on the skin  \ncytomegalovirus (CMV) – a common virus spread through bodily fluids, such as saliva and urine\ntuberculosis (TB) – a bacterial infection spread that causes a persistent cough \nsyphilis – a bacterial infection usually caught by having sex with someone who is infected\ncat scratch disease – a bacterial infection caused by a scratch from an infected cat\nHIV – a virus that attacks the immune system and weakens your ability to fight infections\nlupus – where the immune system starts to attack the body's joints, skin, blood cells and organs\nrheumatoid arthritis – where the immune system starts to attack the tissue lining the joints\nsarcoidosis – where small patches of red and swollen tissue, called granulomas, develop in the organs of the body\n\nClick on the links above for more information on these conditions.\nCould it be cancer?\nOccasionally, swollen glands can be a sign of cancer that has started elsewhere in the body and spread to the lymph nodes, or a type of cancer affecting the white blood cells, such as non-Hodgkin lymphoma or chronic lymphocytic leukaemia.\nSwollen glands are more likely to be caused by cancer if they:\n\ndon't go away within a few weeks and slowly get bigger\nare painless and firm or hard when you touch them\noccur with other symptoms, such as night sweats and weight loss\n\nSee your GP if your glands have been swollen for more than a couple of weeks. The swelling is probably the result of a non-cancerous condition, but it's best to be sure by getting a proper diagnosis.\n\n"}, {"Name": "Testicular Lumps And Swellings", "Cure": "\n\nLumps and swellings in the testicles are a relatively common symptom in boys and men, and can have a number of different causes.\nThe vast majority of testicular lumps and swellings are caused by benign (non-cancerous) conditions that may not need treatment, but it's important to know what's normal for you and to see your GP if you notice any changes in your testicles so they can try to identify the cause.\nWhat causes testicular lumps and swellings?\nThere are many possible reasons why your testicles may become swollen or develop a lump. Some of the main causes are:\n\nvaricoceles – swellings caused by swollen and enlarged veins within the scrotum\nhydroceles – swellings caused by a build-up of fluid around the testicle \nepididymal cysts – lumps caused by a collection of fluid in the epididymis (a coiled tube behind the testicles)\nepididymo-orchitis – inflammation of the epididymis and testicles\ninguinal hernias – where fatty tissue or a part of your bowel pokes through into your groin, which can cause the scrotum to become enlarged\n\nA sudden and severely painful swelling in one of your testicles can be a sign of a condition called testicular torsion, which is where the blood supply to a testicle is interrupted.\nIn rare cases, testicular lumps can be a sign of testicular cancer. Cancer Research UK estimates that fewer than four in every 100 testicular lumps are cancerous.\nRead more about the causes of testicular lumps and swellings\nSeeing your GP\nYou should see your GP if you notice any lumps, swellings or changes in your testicles.\nYour GP will ask you about your symptoms and examine your testicles to try to identify the cause of the problem.\nIn some cases you may be referred for further tests, such as an ultrasound scan of your scrotum, to confirm a diagnosis.\nIf you experience sudden or severe pain in your testicles, it's important to contact your GP immediately or visit your nearest accident and emergency (A&E) department as soon as possible because urgent treatment may be required.\nRead more about diagnosing testicular lumps and swellings\n\n"}, {"Name": "Thigh Problems", "Cure": "\nThigh problems can cause a range of symptoms including pain, swelling and bruising.\nIn many cases, new or flare-up of long-standing thigh problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nSpeak to a healthcare professional as soon as possible if you have difficulty putting any weight at all on your leg.\nWhat causes thigh problems?\nThigh problems can be the result of an injury caused by:\n\noverstretching or twisting during activities or sport\na fall\na direct blow to the thigh\n\nPain on the outside of your thigh may also come on for no apparent reason.\nCan this cause problems anywhere else?\nYou may feel some pain in the muscles around your hip, knee or calf. This should improve as your thigh problem gets better.\nOccasionally, problems felt in your thigh can be caused by a back problem even though you don't feel pain in your back. People with this sort of problem often describe the pain as:\n\npins and needles\nsharp\nhot or burning\n\nSelf-help\nKeeping active is an essential part of your treatment and recovery and is the single best thing you can do for your health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you have less discomfort and good movement. Remember to warm up fully before you start sporting activities.\nExercises to help with thigh problems\nResting or moving?\nWithin the first 24 to 48 hours after a thigh problem you should try to:\n\nrest your leg but avoid long spells of not moving at all\nmove your leg gently for 10 to 20 seconds every hour when you are awake\n\nAfter 48 hours:\n\ntry to use your leg more - exercise really helps your thigh and can relieve pain\ndo whatever you normally would and stay at, or return to work - this is important and is the best way to get better\nlead with your good leg when going upstairs to reduce the strain on your thigh\nlead with your problem leg when going downstairs to reduce the strain on your thigh\nuse a handrail (if available) when going up and downstairs\n\nPain treatments\nPain medication can help to reduce the pain and help you move more comfortably, which can help your recovery.\nSpeak to your community pharmacist or other healthcare professional about taking medication or other methods of pain relief. It's important to take medication regularly.\nMore about taking painkillers\nWork\nIt's recommended you stay at or return to work as quickly as possible during your recovery. You don't need to be pain and symptom-free to return to work.\nHelp and support\nIf, after following the above advice, your thigh problem hasn't improved within 6 weeks a referral to a physiotherapist may be of benefit.\nIf available in your health board area, the Musculoskeletal (MSK) Helpline can refer you to a healthcare professional if you need it.\n"}, {"Name": "Tinnitus", "Cure": "\nTinnitus is the term for hearing sounds that come from inside your body, rather than from an outside source.\nIt's often described as \"ringing in the ears\", although several sounds can be heard, including:\n\nbuzzing\nhumming\ngrinding\nhissing\nwhistling\n\nSome people may hear sounds similar to music or singing, and others hear noises that beat in time with their pulse (pulsatile tinnitus).\nYou may also notice that your hearing is not as good as it used to be or you're more sensitive to everyday sounds (hyperacusis).\nIs it serious?\nTinnitus is rarely a sign of a serious underlying condition. For some people it may come and go and only be a minor irritation.\nHowever, for some people, it can have a significant impact on everyday life and be very distressing, affect concentration, and cause problems such as difficulty sleeping (insomnia) and depression.\nIn many cases, tinnitus will get better gradually over time, either by disappearing or by the body getting used to it (habituation). But it's important to seek medical advice to see if an underlying cause can be found and treated, and to help you find ways to cope with the problem.\nWhen to see your GP\nYou should see your GP if you continually or regularly hear sounds such as buzzing, ringing or humming in your ears.\nThey can examine your ears to see if the problem might be caused by a condition they could easily treat, such as an ear infection or earwax build-up. They can also do some simple checks to see if you have any hearing loss.\nIf necessary, your GP can refer you to a hospital specialist for further tests and treatment.\nRead more about diagnosing tinnitus.\nWhat causes tinnitus?\nTinnitus can develop gradually over time or occur suddenly. It's not clear exactly why it happens, but it often occurs along with some degree of hearing loss.\nTinnitus is often associated with:\n\nage-related hearing loss\ninner ear damage caused by repeated exposure to loud noises\nan earwax build-up\na middle ear infection\nMénière's disease – a condition that also causes hearing loss and vertigo (a spinning sensation)\notosclerosis – an inherited condition where an abnormal bone growth in the middle ear causes hearing loss\n\nHowever, around one in every three people with tinnitus doesn't have any obvious problem with their ears or hearing.\nRead more about the causes of tinnitus.\nWho is affected?\nMost people have experienced short periods of tinnitus after being exposed to loud noises, such as after a music concert.\nIn the UK, more persistent tinnitus is estimated to affect around six million people (10% of the population) to some degree, with about 600,000 (1%) experiencing it to a severity that affects their quality of life.\nTinnitus can affect people of all ages, including children, but is more common in people aged over 65.\nTreating tinnitus\nThere's currently no single treatment for tinnitus that works for everyone. However, research to find an effective treatment is continuing.\nIf an underlying cause of your tinnitus can be found, effectively treating it may help improve your tinnitus – for example, removing a build-up of earwax might help.\nIf a specific cause can't be found, treatment will focus on helping you manage the condition on a daily basis. This may involve:\n\nsound therapy – listening to neutral sounds to distract you from the sound of tinnitus\ncounselling – therapy that aims to educate you about tinnitus and help you learn to cope with it more effectively\ncognitive behavioural therapy (CBT) – therapy that aims to help change the way you think about your tinnitus so it becomes less noticeable\ntinnitus retraining therapy (TRT) – therapy that aims to help retrain the way your brain responds to tinnitus so you start to tune the sound out and become less aware of it\n\nRead more about how tinnitus is treated.\n"}, {"Name": "Toothache", "Cure": "\nToothache refers to pain in and around the teeth and jaws that's usually caused by tooth decay.\nYou may feel toothache in many ways. It can come and go or be constant. Eating or drinking can make the pain worse, particularly if the food or drink is hot or cold.\nThe pain can also be mild or severe. It may feel \"sharp\" and start suddenly. It can be worse at night, particularly when you're lying down. A lost filling or broken tooth can sometimes start the pain.\nIt can also sometimes be difficult to decide whether the pain is in your upper or lower teeth. When a lower molar tooth is affected, the pain can often feel like it's coming from the ear.\nToothache in other upper teeth may feel like it's coming from the sinuses, the small, air-filled cavities behind your cheekbones and forehead.\nThe area of your jaw close to the infected tooth may also be sore and tender to touch.\nIt's also possible for periodontal disease to give rise to a \"dull\" pain. Periodontal disease is a bacterial infection that affects the soft and hard structures that support the teeth.\nWhen to see your dentist\nIf you have toothache for more than one or two days, visit your dentist as soon as possible to have it treated. The longer you leave it, the worse it will get.\nIf your toothache isn't treated, the pulp inside your tooth will eventually become infected. This can usually lead to a dental abscess, with severe and continuous throbbing pain.\nPainkillers, such as paracetamol and ibuprofen, may reduce the pain and discomfort while you're waiting for an appointment. Children under 16 years of age shouldn't be given aspirin.\nFind a dentist near you.\nWhat causes toothache?\nToothache occurs when the innermost layer of the tooth (dental pulp) becomes inflamed. The pulp is made up of sensitive nerves and blood vessels.\nDental pulp can become inflamed as a result of:\n\ntooth decay – this leads to holes (cavities) forming in the hard surface of the tooth\na cracked tooth – the crack is often so small that it can't be seen with the naked eye\nloose or broken fillings\nreceding gums – where the gums shrink (contract) to expose softer, more sensitive parts of the tooth root\nperiapical abscess – a collection of pus at the end of the tooth caused by a bacterial infection\n\nThere are a number of other conditions that can cause pain similar to toothache, even though the pulp isn't affected. These include:\n\nperiodontal abscess – a collection of pus in the gums caused by a bacterial infection\nulcers on your gums\nsore or swollen gums around a tooth that's breaking through – for example, when your wisdom teeth start to come through \nsinusitis – which sometimes causes pain around the upper jaw\nan injury to the joint that attaches the jaw to the skull (temporomandibular joint)\n\nBabies can also experience discomfort when their teeth start to develop. This is known as teething.\nTreating toothache\nThe type of treatment you have for toothache will depend on the cause of the pain, so your dentist will examine your mouth and may carry out an X-ray to try to identify the problem.\nIf your toothache is caused by tooth decay, your dentist will remove the decayed area and replace it with a filling.\nIf your toothache is caused by a loose or broken filling, the filling will be taken out, any decay will be removed, and a new filling put in place.\nIf the pulp inside your tooth is infected, you may need root canal treatment. This procedure involves removing the infected pulp and then inserting a special type of filling to seal the tooth and prevent reinfection.\nYour tooth may need to be removed if the toothache can't be treated using these methods or the tooth is wedged between another tooth and your jaw (impacted).\nPreventing toothache\nThe best way to avoid getting toothache and other dental problems is to keep your teeth and gums as healthy as possible. To do this, you should:\n\nlimit your intake of sugary foods and drinks – you should have these as an occasional treat and only at mealtimes; read more about cutting down on sugar\nbrush your teeth twice a day using a toothpaste that contains fluoride – gently brush your gums and tongue as well\nclean between your teeth using dental floss and, if necessary, use a mouthwash \ndon't smoke – it can make some dental problems worse\n\nMake sure you have regular dental check-ups, preferably with the same dentist. \nThe time between check-ups can vary, depending on how healthy your teeth and gums are and your risk of developing future problems.\nYour dentist will suggest when you should have your next check-up based on your overall oral health.\nChildren should have a dental check-up every six months so tooth decay can be spotted and treated early.\nRead more about taking care of your teeth and keeping your teeth clean.\n"}, {"Name": "Urinary Incontinence", "Cure": "\nUrinary incontinence is the unintentional passing of urine. It is a common problem and is thought to affect millions of people worldwide.\nIt's not clear exactly how many people are affected, but it's estimated that between 3 and 6 million people in the UK may have some degree of urinary incontinence.\nUrinary incontinence affects both men and women, but it tends to be more common in women overall.\nSigns and symptoms\nThe symptoms of urinary incontinence depend on the type you have.\nThere are several types of urinary incontinence, but the most common are:\n\nstress incontinence – when urine leaks out at times when your bladder is under pressure, for example when you cough or laugh\nurge incontinence – when urine leaks as you feel a sudden, intense urge to pass urine, or soon afterwards\n\nIt is also possible to have a mixture of both stress and urge urinary incontinence.\nRead more about the symptoms of urinary incontinence\nWhat causes urinary incontinence?\nThe causes of urinary incontinence depend on the type.\nStress incontinence is usually the result of the weakening or damaging of the muscles used to prevent urination, such as the pelvic floor muscles and the urethral sphincter.\nUrge incontinence is usually the result of overactivity of the detrusor muscle, which controls the bladder.\nCertain things can increase the chances of urinary incontinence developing, including:\n\npregnancy and vaginal birth\nobesity\na family history of incontinence\nincreasing age – although incontinence is not an inevitable part of ageing\n\nRead more about the causes of urinary incontinence\nSeeking medical advice\nAlthough you may feel embarrassed talking to someone about your symptoms, it's a good idea to see your GP if you have any type of urinary incontinence as this can be the first step towards finding a way to effectively manage the problem.\nUrinary incontinence can usually be diagnosed after a consultation with your GP, who will ask about your symptoms and may carry out a pelvic examination (in women) or rectal examination (in men).\nYour GP may also suggest you keep a diary in which you note how much fluid you drink and how often you have to urinate.\nRead more about diagnosing urinary incontinence\nHow urinary incontinence is treated\nInitially, your GP may suggest some simple measures to see if they help improve your symptoms. These may include:\n\nlifestyle changes, such as losing weight and cutting down on caffeine and alcohol\npelvic floor exercises (exercising your pelvic floor muscles by squeezing them) taught by a specialist\nbladder training (where you learn ways to help you wait longer between needing to urinate and passing urine) guided by a specialist\n\nYou may also benefit from the use of incontinence products, such as absorbent pads and hand-held urinals (urine collection bottles).\nIf you are still unable to manage your symptoms, medication may be recommended.\nSurgery may also be considered. The specific procedures suitable for you will depend on the type of incontinence you have.\nSurgical treatments for stress incontinence, such as tape or sling procedures, are used to reduce pressure on the bladder, or strengthen the muscles that control urination.\nOperations to treat urge incontinence include enlarging the bladder or implanting a device that stimulates the nerve that controls the detrusor muscles.\nRead more about non-surgical treatments for urinary incontinence and surgery and procedures for urinary incontinence\nPreventing urinary incontinence\nIt is not always possible to prevent urinary incontinence, but there are some steps you can take that may help reduce the chance of it developing, such as:\n\ncontrolling your weight\navoiding or cutting down on alcohol\nkeeping fit – in particular, ensuring that your pelvic floor muscles are strong\ntrying to keep your pelvic floor muscles strong\n\nRead more about preventing urinary incontinence\n"}, {"Name": "Urinary Tract Infection Uti", "Cure": "\nUrinary tract infections (UTIs) are common infections that can affect the bladder, the kidneys and the tubes connected to them.\nAnyone can get them, but they're particularly common in women. Some women experience them regularly (called recurrent UTIs).\nUTIs can be painful and uncomfortable, but usually pass within a few days and can be easily treated with antibiotics.\nThis page is about UTIs in adults. There is a separate article about UTIs in children.\nThis page covers:\nSymptoms\nWhen to get medical advice\nTreatment\nCauses\nPrevention\nSymptoms of UTIs\nInfections of the bladder (cystitis) or urethra (tube that carries urine out of the body) are known as lower UTIs. These can cause:\n\na need to pee more often than usual\npain or discomfort when peeing\nsudden urges to pee\nfeeling as though you're unable to empty your bladder fully\npain low down in your tummy\nurine that's cloudy, foul-smelling or contains blood\nfeeling generally unwell, achy and tired\n\nInfections of the kidneys or ureters (tubes connecting the kidneys to the bladder) are known as upper UTIs. These can cause the above symptoms and also:\n\na high temperature (fever) of 38C (100.4ºF) or above\npain in your sides or back\nshivering and chills\nfeeling and being sick\nconfusion\nagitation or restlessness\n\nLower UTIs are common and aren't usually a cause for major concern. Upper UTIs can be serious if left untreated, as they could damage the kidneys or spread to the bloodstream.\n"}, {"Name": "Vertigo", "Cure": "\nVertigo is a symptom, rather than a condition itself. It's the sensation that you, or the environment around you, is moving or spinning.\nThis feeling may be barely noticeable, or it may be so severe that you find it difficult to keep your balance and do everyday tasks.\nAttacks of vertigo can develop suddenly and last for a few seconds, or they may last much longer. If you have severe vertigo, your symptoms may be constant and last for several days, making normal life very difficult.\nOther symptoms associated with vertigo may include:\n\nloss of balance – which can make it difficult to stand or walk\nfeeling sick or being sick\ndizziness\n\nSeeking medical help\nYou should see your GP if you have persistent signs of vertigo or it keeps coming back.\nYour GP will ask about your symptoms and can carry out a simple examination to help determine some types of vertigo. They may also refer you for further tests.\nRead more about diagnosing vertigo\nWhat causes vertigo?\nVertigo is commonly caused by a problem with the way balance works in the inner ear, although it can also be caused by problems in certain parts of the brain.\nCauses of vertigo may include:\n\nbenign paroxysmal positional vertigo (BPPV) – where certain head movements trigger vertigo\nmigraines – severe headaches\nlabyrinthitis – an inner ear infection\nvestibular neuronitis – inflammation of the vestibular nerve, which runs into the inner ear and sends messages to the brain that help to control balance\n\nDepending on the condition causing vertigo, you may experience additional symptoms, such as a high temperature, ringing in your ears (tinnitus) and hearing loss.\nRead more about the causes of vertigo\nHow is vertigo treated?\nSome cases of vertigo improve over time, without treatment. However, some people have repeated episodes for many months, or even years, such as those with Ménière's disease.\nThere are specific treatments for some causes of vertigo. A series of simple head movements (known as the Epley manoeuvre) is used to treat BPPV.\nMedicines, such as prochlorperazine and some antihistamines, can help in the early stages or most cases of vertigo.\nMany people with vertigo also benefit from vestibular rehabilitation training (VRT), which is a series of exercises for people with dizziness and balance problems.\nRead more about treating vertigo\nSelf care\nDepending on what's causing your vertigo, there may be things you can do yourself to help relieve your symptoms. Your GP or the specialist treating you may advise you to:\n\ndo simple exercises to correct your symptoms\nsleep with your head slightly raised on two or more pillows\nget up slowly when getting out of bed and sit on the edge of the bed for a minute or so before standing\navoid bending down to pick up items\navoid extending your neck – for example, while reaching up to a high shelf\nmove your head carefully and slowly during daily activities\ndo exercises that trigger your vertigo, so your brain gets used to it and reduces the symptoms (do these only after making sure you won't fall, and have support if needed)\n\nFear of heights\nThe term vertigo is often incorrectly used to describe a fear of heights. The medical term for a fear of heights and the dizzy feeling associated with looking down from a high place is \"acrophobia\".\nRead more about phobias for advice and information.\n"}, {"Name": "Vomiting In Adults", "Cure": "\n\nNausea and vomiting in adults isn't usually a sign of anything serious and tends to only last 1 or 2 days.\nVomiting is the body’s way of ridding itself of harmful substances from the stomach, or it may be a reaction to something that has irritated the gut.\nOne of the most common causes of vomiting in adults is gastroenteritis. This is an infection of the gut usually caused by bacteria or a virus, which will normally improve within a few days.\nHowever, vomiting can occasionally be a sign of something more serious, such as appendicitis, so if you are feeling very unwell or are worried about your vomiting, trust your instincts and call your GP.\nThere is a separate topic on vomiting in children and babies\n\n"}, {"Name": "Warts And Verrucas", "Cure": "\nWarts are small lumps that often develop on the skin of the hands and feet.\nWarts vary in appearance and may develop singly or in clusters. Some are more likely to affect particular areas of the body. For example, verrucas are warts that usually develop on the soles of the feet.\nWarts are non-cancerous, but can resemble certain cancers.\nMost people will have warts at some point in their life. They tend to affect children and teenagers more than adults.\nRead more about the symptoms of warts.\nWhat causes warts?\nWarts are caused by an infection with the human papilloma virus (HPV).\nThe virus causes an excess amount of keratin, a hard protein, to develop in the top skin layer (epidermis). The extra keratin produces the rough, hard texture of a wart.\nRead more about the causes of warts.\nAre warts contagious?\nWarts aren't considered very contagious, but they can be caught by close skin-to-skin contact. The infection can also be transmitted indirectly from contaminated objects or surfaces, such as the area surrounding a swimming pool.\nYou are more likely to get infected if your skin is wet or damaged. After you become infected, it can take weeks or even months for a wart or verruca to appear.\nWhen to get professional advice\n"}, {"Name": "Warts And Verrucas", "Cure": "\nWarts are small lumps that often develop on the skin of the hands and feet.\nWarts vary in appearance and may develop singly or in clusters. Some are more likely to affect particular areas of the body. For example, verrucas are warts that usually develop on the soles of the feet.\nWarts are non-cancerous, but can resemble certain cancers.\nMost people will have warts at some point in their life. They tend to affect children and teenagers more than adults.\nRead more about the symptoms of warts.\nWhat causes warts?\nWarts are caused by an infection with the human papilloma virus (HPV).\nThe virus causes an excess amount of keratin, a hard protein, to develop in the top skin layer (epidermis). The extra keratin produces the rough, hard texture of a wart.\nRead more about the causes of warts.\nAre warts contagious?\nWarts aren't considered very contagious, but they can be caught by close skin-to-skin contact. The infection can also be transmitted indirectly from contaminated objects or surfaces, such as the area surrounding a swimming pool.\nYou are more likely to get infected if your skin is wet or damaged. After you become infected, it can take weeks or even months for a wart or verruca to appear.\nWhen to get professional advice\n"}, {"Name": "Wrist Hand And Finger Problems", "Cure": "\nWrist, hand and finger problems can cause a range of symptoms including pain, swelling, stiffness, pins and needles and numbness.\nIn many cases, new or flare-up of long-standing wrist, hand and finger problems should begin to settle within 6 weeks without the need to see a healthcare professional.\nWhen to seek help\nSpeak to a healthcare professional as soon as possible if:\n\nyour wrist or fingers are misshapen following an injury\nyou can't move your wrist, hand or fingers at all\nyou develop pain and stiffness in the small joints in your hand in the mornings that takes more than 30 minutes to settle\n\nWhat causes wrist, hand and finger problems?\nProblems with the wrist, hand, and fingers are common and can be caused by simple things like carrying out repetitive tasks or an injury during sport or a fall.\nAs you get older, normal age-related changes can cause your problem to flare-up now and again, often for no reason.\nCan this cause problems anywhere else?\nYou may feel pain and stiffness in your forearm. This should improve as your problem gets better.\nSelf-help\nKeeping your wrist, fingers and thumb moving is an essential part of your treatment and recovery. Keeping active's the single best thing you can do for your general health.\nBeing physically active can:\n\nmaintain your current levels of fitness – even if you have to modify what you normally do, any activity is better than none\nkeep your other muscles and joints strong and flexible\nprevent a recurrence of the problem\nhelp you aim for a healthy body weight\n\nAvoid sports or heavy lifting until you have less discomfort and good movement. Remember to warm up fully before you start sporting activities.\nExercises to help with wrist, hand and finger problems\nResting or moving?\nWithin the first 24 to 48 hours after a wrist, hand or finger/thumb problem developing you should try to:\n\nrest your wrist, hand or finger/thumb but avoid long spells of not moving at all\nmove your wrist, hand or finger/thumb gently for 10 to 20 seconds every hour when you're awake\n\nAfter 48 hours:\n\ntry to use your arm more - exercise really helps you hand\ndo whatever you normally would and stay at, or return to work - this is important and is the best way to get better\n\nPain treatments\nPain medication can help to reduce the pain and help you move more comfortably, which can help your recovery.\nSpeak to your community pharmacist or other healthcare professional about taking medication or other methods of pain relief. It's important to take medication regularly.\nMore about taking painkillers\nWork\nIt's recommended you stay at or return to work as quickly as possible during your recovery. You don't need to be pain and symptom-free to return to work.\nHelp and support\nIf, after following the above advice, your wrist, or hand, finger or thumb problem hasn't improved within 6 weeks a referral to a physiotherapist or occupational therapist may be of benefit.\nIf available in your health board area, the Musculoskeletal (MSK) Helpline can refer you to a healthcare professional if you need it.\n"}]